import React from "react";

interface dict {
    '1-1': object,
    '1-2': object,
    '1-3': object,
    '1-4': object,
    '2-1': object,
    '2-2': object,
    '2-3': object,
    '2-4': object,
    '3-1': object,
    '3-2': object,
    '3-3': object,
    '3-4': object,
    '4-1': object,
    '4-2': object,
    '4-3': object,
    '4-4': object,
}

const content1 =
    "<h1>烛之武退秦师</h1>" +
    "<h3>【作者】左丘明 【朝代】先秦</h3>" +
    "<p>晋侯、秦伯围郑，以其无礼于晋，且贰于楚也。晋军函陵，秦军氾南。</p>" +
    "<p>佚之狐言于郑伯曰：“国危矣，若使烛之武见秦君，师必退。”公从之。辞曰：“臣之壮也，犹不如人；今老矣，无能为也已。”公曰：“吾不能早用子，今急而求子，是寡人之过也。然郑亡，子亦有不利焉。”许之。</p>" +
    "<p>夜缒而出，见秦伯，曰：“秦、晋围郑，郑既知亡矣。若亡郑而有益于君，敢以烦执事。越国以鄙远，君知其难也。焉用亡郑以陪邻？邻之厚，君之薄也。若舍郑以为东道主，行李之往来，共其乏困，君亦无所害。且君尝为晋君赐矣，许君焦、瑕，朝济而夕设版焉，君之所知也。夫晋，何厌之有？既东封郑，又欲肆其西封，若不阙秦，将焉取之？阙秦以利晋，唯君图之。”秦伯说，与郑人盟。使杞子、逢孙、杨孙戍之，乃还。</p>" +
    "<p>子犯请击之，公曰：“不可。微夫人之力不及此。因人之力而敝之，不仁；失其所与，不知；以乱易整，不武。吾其还也。”亦去之。</p>";

const words1 = [
    {
        name: "以",
        mean: "连词，因为。",
        regex: "(?<=，)以(?=其)",
    },
    {
        name: "无礼",
        mean: "形容词作动词，对……无礼。",
        regex: "(?<=其)无礼(?=于)",
    },
    {
        name: "贰",
        mean: "从属二主。",
        regex: "(?<=且)贰(?=于)",
    },
    {
        name: "军",
        mean: "名词作动词，驻军。",
        regex: "(?<=晋)军(?=函)",
    },
    {
        name: "师",
        mean: "军队。",
        regex: "(?<=，)师(?=必)",
    },
    {
        name: "从",
        mean: "同意。",
        regex: "(?<=公)从(?=之)",
    },
    {
        name: "已",
        mean: "同“矣”。",
        regex: "(?<=也)已(?=。)",
    },
    {
        name: "而",
        mean: "表因果。",
        regex: "(?<=急)而(?=求)",
    },
    {
        name: "缒",
        mean: "用绳子拴着人（或物）从上往下送。",
        regex: "(?<=夜)缒(?=而)",
    },
    {
        name: "执事",
        mean: "办事的官吏，对对方的敬称。",
        regex: "(?<=烦)执事(?=。)",
    },
    {
        name: "鄙远",
        mean: "名词作动词，把……作为边邑",
        regex: "(?<=以)鄙远(?=，)",
    },
    {
        name: "焉用亡郑以陪邻",
        mean: "为什么要灭掉郑国而给邻国增加土地呢。焉",
        regex: "(?<=。)焉用亡郑以陪邻(?=？)",
    },
    {
        name: "舍",
        mean: "放弃(围郑)。",
        regex: "(?<=若)舍(?=郑)",
    },
    {
        name: "东道主",
        mean: "东边道路上的主人。",
        regex: "(?<=为)东道主(?=，)",
    },
    {
        name: "行李",
        mean: "出使的人。",
        regex: "(?<=，)行李(?=之)",
    },
    {
        name: "共",
        mean: "通“供”，供给。",
        regex: "(?<=，)共(?=其)",
    },
    {
        name: "乏困",
        mean: "缺乏的物资。",
        regex: "(?<=其)乏困(?=，)",
    },
    {
        name: "为",
        mean: "给予。",
        regex: "(?<=尝)为(?=晋)",
    },
    {
        name: "朝济而夕设版焉",
        mean: "指晋惠公早上渡过黄河回国，晚上就修筑防御工事。济，渡河。设版，修筑防御工事。版，筑土墙用的夹板。",
        regex: "(?<=，)朝济而夕设版焉(?=，)",
    },
    {
        name: "何厌之有",
        mean: "有何厌之，有什么满足的呢。厌，满足。",
        regex: "(?<=，)何厌之有(?=？)",
    },
    {
        name: "肆",
        mean: "延伸，扩张。",
        regex: "(?<=欲)肆(?=其)",
    },
    {
        name: "图",
        mean: "考虑。",
        regex: "(?<=君)图(?=之)",
    },
    {
        name: "敝",
        mean: "损害。",
        regex: "(?<=而)敝(?=之)",
    },
    {
        name: "与",
        mean: "结交，亲附。",
        regex: "(?<=所)与(?=，)",
    },
];

const content2 =
    "<h1>邹忌讽齐王纳谏</h1>" +
    "<h3>【作者】《战国策》 【朝代】先秦</h3>" +
    "<p>邹忌修八尺有余，而形貌昳丽。朝服衣冠，窥镜，谓其妻曰：“我孰与城北徐公美？”其妻曰：“君美甚，徐公何能及君也？”城北徐公，齐国之美丽者也。忌不自信，而复问其妾曰：“吾孰与徐公美？”妾曰：“徐公何能及君也？”旦日，客从外来，与坐谈，问之客曰：“吾与徐公孰美？”客曰：“徐公不若君之美也。”明日徐公来，孰视之，自以为不如；窥镜而自视，又弗如远甚。暮寝而思之，曰：“吾妻之美我者，私我也；妾之美我者，畏我也；客之美我者，欲有求于我也。”</p>" +
    "<p>于是入朝见威王，曰：“臣诚知不如徐公美。臣之妻私臣，臣之妾畏臣，臣之客欲有求于臣，皆以美于徐公。今齐地方千里，百二十城，宫妇左右莫不私王，朝廷之臣莫不畏王，四境之内莫不有求于王：由此观之，王之蔽甚矣。”</p>" +
    "<p>王曰：“善。”乃下令：“群臣吏民能面刺寡人之过者，受上赏；上书谏寡人者，受中赏；能谤讥于市朝，闻寡人之耳者，受下赏。”令初下，群臣进谏，门庭若市；数月之后，时时而间进；期年之后，虽欲言，无可进者。燕、赵、韩、魏闻之，皆朝于齐。此所谓战胜于朝廷。</p>";

const words2 = [
    {
        name: "讽",
        mean: "讽谏，用暗示，比喻之类的方法，委婉的规劝。",
        regex: "(?<=忌)讽(?=齐)",
    },
    {
        name: "修",
        mean: "身长。",
        regex: "(?<=忌)修(?=八)",
    },
    {
        name: "昳丽",
        mean: "光艳美丽。",
        regex: "(?<=貌)昳丽(?=。)",
    },
    {
        name: "服",
        mean: "名词作状语，穿戴。",
        regex: "(?<=朝)服(?=衣)",
    },
    {
        name: "窥镜",
        mean: "照镜子。",
        regex: "(?<=，)窥镜(?=，)",
    },
    {
        name: "与",
        mean: "和。",
        regex: "(?<=孰)与(?=城)",
    },
    {
        name: "与坐谈",
        mean: "省略句，与之坐谈。",
        regex: "(?<=，)与坐谈(?=，)",
    },
    {
        name: "寝",
        mean: "躺着。",
        regex: "(?<=暮)寝(?=而)",
    },
    {
        name: "美",
        mean: "形容词意动用法，以……为美。",
        regex: "(?<=之)美(?=我)",
    },
    {
        name: "私",
        mean: "动词，偏爱。",
        regex: "(?<=，)私(?=我)",
    },
    {
        name: "美",
        mean: "形容词意动用法，以……为美。",
        regex: "(?<=之)美(?=我)",
    },
    {
        name: "地方",
        mean: "地，土地，疆域。方，方圆。",
        regex: "(?<=齐)地方(?=千)",
    },
    {
        name: "左右",
        mean: "身边的近臣。",
        regex: "(?<=妇)左右(?=莫)",
    },
    {
        name: "蔽",
        mean: "形容词作动词，受蒙蔽。",
        regex: "(?<=之)蔽(?=甚)",
    },
    {
        name: "面刺",
        mean: "当面指责。",
        regex: "(?<=能)面刺(?=寡)",
    },
    {
        name: "受",
        mean: "通“授”，给予，付予。",
        regex: "(?<=，)受(?=上)",
    },
    {
        name: "谤讥于市朝",
        mean: "在公众场所议论（君王的过失）。谤，公开指责别人的过错。讥，讽喻。谤讥，在这里指“指责，议论”，没有贬意。市朝，众人集聚的公共场所。",
        regex: "(?<=能)谤讥于市朝(?=，)",
    },
    {
        name: "闻",
        mean: "动词使动用法，使……听到。",
        regex: "(?<=，)闻(?=寡)",
    },
    {
        name: "时时而间进",
        mean: "有时候偶然进谏。间进，偶然有人进谏。间，间或，偶然，有时候。",
        regex: "(?<=，)时时而间进(?=；)",
    },
    {
        name: "期年",
        mean: "满一年。",
        regex: "(?<=；)期年(?=之)",
    },
    {
        name: "此所谓战胜于朝廷",
        mean: "这就是身居朝廷，不必用兵，就战胜了敌国。",
        regex: "(?<=。)此所谓战胜于朝廷(?=。)",
    },
];

const content3 =
    "<h1>子路曾皙冉有公西华侍坐</h1>" +
    "<p>子路、曾皙、冉有、公西华侍坐。</p>" +
    "<p>子曰：“以吾一日长乎尔，毋吾以也。居则曰：‘不吾知也。’如或知尔，则何以哉？”</p>" +
    "<p>子路率尔而对曰：“千乘之国，摄乎大国之间，加之以师旅，因之以饥馑；由也为之，比及三年，可使有勇，且知方也。”</p>" +
    "<p>夫子哂之。</p>" +
    "<p>“求，尔何如？”</p>" +
    "<p>对曰：“方六七十，如五六十，求也为之，比及三年，可使足民。如其礼乐，以俟君子。”</p>" +
    "<p>“赤，尔何如？”</p>" +
    "<p>对曰：“非曰能之，愿学焉。宗庙之事，如会同，端章甫，愿为小相焉。”</p>" +
    "<p>“点，尔何如？”</p>" +
    "<p>鼓瑟希，铿尔，舍瑟而作，对曰：“异乎三子者之撰。”</p>" +
    "<p>子曰：“何伤乎？亦各言其志也！”</p>" +
    "<p>曰：“莫春者，春服既成，冠者五六人，童子六七人，浴乎沂，风乎舞雩，咏而归。”</p>" +
    "<p>夫子喟然叹曰：“吾与点也。”</p>" +
    "<p>三子者出，曾皙后。曾皙曰：“夫三子者之言何如？”</p>" +
    "<p>子曰：“亦各言其志也已矣！”</p>" +
    "<p>曰：“夫子何哂由也？”</p>" +
    "<p>曰：“为国以礼，其言不让，是故哂之。”</p>" +
    "<p>“唯求则非邦也与？”</p>" +
    "<p>“安见方六七十，如五六十而非邦也者？”</p>" +
    "<p>“唯赤则非邦也与？”</p>" +
    "<p>“宗庙会同，非诸侯而何？赤也为之小，孰能为之大？”</p>";

const words3 = [
    {
        name: "侍",
        mean: "侍奉, 本指侍立于尊者之旁。",
        regex: "(?<=华)侍(?=坐)",
    },
    {
        name: "以吾一日长乎尔",
        mean: "以， 因为。长，年长。",
        regex: "(?<=“)以吾一日长乎尔(?=，)",
    },
    {
        name: "毋吾以也",
        mean: "吾，作“以 ”的宾语，在否定句中代词宾语前置。以，同“已”， 是“止”的意思。毋，不要。",
        regex: "(?<=，)毋吾以也(?=。)",
    },
    {
        name: "居则曰",
        mean: "（你们）平日说。 居，平日，平时。",
        regex: "(?<=。)居则曰(?=：)",
    },
    {
        name: "不吾知",
        mean: "即＂不知吾＂，不了解我。",
        regex: "(?<=‘)不吾知(?=也)",
    },
    {
        name: "何以",
        mean: "用什么（去实现自己的抱负）。以，动词，用。",
        regex: "(?<=则)何以(?=哉)",
    },
    {
        name: "率尔",
        mean: "急遽而不加考虑的样子。尔，相当于 “然”，……的样子。",
        regex: "(?<=路)率尔(?=而)",
    },
    {
        name: "千乘之国",
        mean: "有一千辆兵车的诸侯国。在春秋后期 ，千乘之国是中等国家。乘，兵车。古时一车四马为一乘。春秋时，一辆兵车配甲士3人，步卒72人。",
        regex: "(?<=“)千乘之国(?=，)",
    },
    {
        name: "摄乎大国之间",
        mean: "摄，夹处。乎，于，在。",
        regex: "(?<=，)摄乎大国之间(?=，)",
    },
    {
        name: "加之以师旅",
        mean: "有（别国的）军队来攻打它；加，加在上面；师旅，指军队，此特指侵略的军队。古时两千五百人为一师，五百人为一旅。",
        regex: "(?<=，)加之以师旅(?=，)",
    },
    {
        name: "因之以饥馑",
        mean: "接连下来（国内） 又有饥荒。因，接续；饥馑，泛指饥荒。",
        regex: "(?<=，)因之以饥馑(?=；)",
    },
    {
        name: "为之",
        mean: "治理这个国家。为，治。",
        regex: "(?<=也)为之(?=，)",
    },
    {
        name: "比及",
        mean: "等到。",
        regex: "(?<=，)比及(?=三)",
    },
    {
        name: "哂",
        mean: "微笑。",
        regex: "(?<=子)哂(?=之)",
    },
    {
        name: "足",
        mean: "使动用法，使……富足。",
        regex: "(?<=使)足(?=民)",
    },
    {
        name: "俟",
        mean: "等待。",
        regex: "(?<=以)俟(?=君)",
    },
    {
        name: "能",
        mean: "动词，能做到，胜任。",
        regex: "(?<=曰)能(?=之)",
    },
    {
        name: "会同",
        mean: "会，诸侯会盟。同，诸侯共同朝见天子。",
        regex: "(?<=如)会同(?=，)",
    },
    {
        name: "端章甫",
        mean: "穿着礼服，戴着礼帽。端，古代的一种礼帽。章甫，古代的一种礼服。这里都是名词用作动词。",
        regex: "(?<=，)端章甫(?=，)",
    },
    {
        name: "相",
        mean: "在祭祀、会盟或朝见天子时主持赞礼和司仪的人。",
        regex: "(?<=小)相(?=焉)",
    },
    {
        name: "希",
        mean: "同“稀”，稀疏，这里指鼓瑟的声音已接近尾声。",
        regex: "(?<=瑟)希(?=，)",
    },
    {
        name: "舍",
        mean: "放下。",
        regex: "(?<=，)舍(?=瑟)",
    },
    {
        name: "作",
        mean: "立起来，站起身。",
        regex: "(?<=而)作(?=，)",
    },
    {
        name: "撰",
        mean: "才具，才能。",
        regex: "(?<=之)撰(?=。)",
    },
    {
        name: "伤",
        mean: "妨害。",
        regex: "(?<=何)伤(?=乎)",
    },
    {
        name: "莫春者，春服既成",
        mean: "莫春，指农历三月；莫，通“暮”；既，副词，已经。",
        regex: "(?<=“)莫春者，春服既成(?=，)",
    },
    {
        name: "冠者五六人，童子六七人",
        mean: "几个成人，几个孩子；五六，六七，都是虚数。冠，古时男子二十岁为成年，束发加冠。",
        regex: "(?<=，)冠者五六人，童子六七人(?=，)",
    },
    {
        name: "喟然",
        mean: "叹息的样子。",
        regex: "(?<=子)喟然(?=叹)",
    },
    {
        name: "后",
        mean: "动词，后出。",
        regex: "(?<=皙)后(?=。)",
    },
    {
        name: "夫子何哂由也",
        mean: "何，为什么。",
        regex: "(?<=“)夫子何哂由也(?=？)",
    },
    {
        name: "为国以礼，其言不让",
        mean: "要用礼来治理国家，可他说话却不知道谦虚。以，介词。靠， 用；让，礼让，谦逊。",
        regex: "(?<=“)为国以礼，其言不让(?=，)",
    },
    {
        name: "唯求则非邦也与",
        mean: "唯，难道；邦，国家，这是指国家大事；与，同“欤”，疑问语气词。",
        regex: "(?<=“)唯赤则非邦也与(?=？)",
    },
];


const content4 =
    "<h1>寡人之于国也</h1>" +
    "<p>梁惠王曰：“寡人之于国也，尽心焉耳矣。河内凶，则移其民于河东，移其粟于河内；河东凶亦然。察邻国之政，无如寡人之用心者。邻国之民不加少，寡人之民不加多，何也？”</p>" +
    "<p>孟子对曰：“王好战，请以战喻。填然鼓之，兵刃既接，弃甲曳兵而走。或百步而后止，或五十步而后止。以五十步笑百步，则何如？”</p>" +
    "<p>梁惠王曰：“不可，直不百步耳，是亦走也。”</p>" +
    "<p>孟子曰：“王如知此，则无望民之多于邻国也。”</p>" +
    "<p>“不违农时，谷不可胜食也；数罟不入洿池，鱼鳖不可胜食也；斧斤以时入山林，材木不可胜用也。谷与鱼鳖不可胜食，材木不可胜用，是使民养生丧死无憾也。养生丧死无憾，王道之始也。”</p>" +
    "<p>“五亩之宅，树之以桑，五十者可以衣帛矣；鸡豚狗彘之畜，无失其时，七十者可以食肉矣；百亩之田，勿夺其时，数口之家可以无饥矣；谨庠序之教，申之以孝悌之义，颁白者不负戴于道路矣。七十者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。”</p>" +
    "<p>“狗彘食人食而不知检，涂有饿莩而不知发，人死，则曰：‘非我也，岁也。’是何异于刺人而杀之，曰：‘非我也，兵也。’？王无罪岁，斯天下之民至焉。”</p>";

const words4 = [
    {
        name: "寡人",
        mean: "寡德之人。是古代国君对自己的谦称。",
        regex: "(?<=“)寡人(?=之)",
    },
    {
        name: "焉耳矣",
        mean: "焉、耳、矣都是句末助词，重叠使用，加重语气。",
        regex: "(?<=心)焉耳矣(?=。)",
    },
    {
        name: "河内",
        mean: "今河南境内黄河以北的地方。古人以中原地区为中心，所以黄河以北称河内，黄河以南称河外。",
        regex: "(?<=内)凶(?=，)",
    },
    {
        name: "凶",
        mean: "谷物收成不好,荒年。",
        regex: "(?<=其)粟(?=于)",
    },
    {
        name: "河东",
        mean: "黄河以东的地方。在今山西西南部。黄河流经山西省境，自北而南，故称山西境内黄河以东的地区为河东。",
        regex: "(?<=于)河内(?=；)",
    },
    {
        name: "粟",
        mean: "谷子，脱壳后称为小米，也泛指谷类。",
        regex: "(?<=；)河东(?=凶)",
    },
    {
        name: "亦然",
        mean: "也是这样。",
        regex: "(?<=凶)亦然(?=。)",
    },
    {
        name: "无如",
        mean: "没有像……。",
        regex: "(?<=，)无如(?=寡)",
    },
    {
        name: "加少",
        mean: "更少。下文“加多”，更多。加，副词，更、再。",
        regex: "(?<=不)加少(?=，)",
    },
    {
        name: "填",
        mean: "拟声词，模拟鼓声。",
        regex: "(?<=。)填(?=然)",
    },
    {
        name: "鼓之",
        mean: "敲起鼓来，发动进攻。古人击鼓进攻，鸣锣退兵。鼓，动词。之，没有实在意义的衬字。",
        regex: "(?<=然)鼓之(?=，)",
    },
    {
        name: "兵刃既接",
        mean: "两军的兵器已经接触，指战斗已开始。兵，兵器、武器。既，已经。接，接触，交锋。",
        regex: "(?<=，)兵刃既接(?=，)",
    },
    {
        name: "弃甲曳兵",
        mean: "抛弃铠甲，拖着兵器。曳，yè，拖着。",
        regex: "(?<=，)弃甲曳兵(?=而)",
    },
    {
        name: "走",
        mean: "跑，这里指逃跑。",
        regex: "(?<=而)走(?=。)",
    },
    {
        name: "直",
        mean: "只是、不过。",
        regex: "(?<=，)直(?=不)",
    },
    {
        name: "不违农时",
        mean: "指农忙时不要征调百姓服役。违，违背、违反，这里指耽误。",
        regex: "(?<=“)不违农时(?=，)",
    },
    {
        name: "谷不可胜食",
        mean: "粮食吃不完。谷，粮食的统称。胜，尽。",
        regex: "(?<=，)谷不可胜食(?=也)",
    },
    {
        name: "数罟不入洿池",
        mean: "这是为了防止破坏鱼的生长和繁殖。数(cù)，密。罟(gǔ)，网。洿(wū)，深。",
        regex: "(?<=；)数罟不入洿池(?=，)",
    },
    {
        name: "斤",
        mean: "与斧相似，比斧小而刃横。",
        regex: "(?<=斧)斤(?=以)",
    },
    {
        name: "时",
        mean: "时令季节。砍伐树木宜于在草木凋落，生长季节过后的秋冬时节进行。",
        regex: "(?<=以)时(?=入)",
    },
    {
        name: "养生丧死",
        mean: "养生，供养活着的人。丧死，为死了的人办丧事。",
        regex: "(?<=。)养生丧死(?=无)",
    },
    {
        name: "憾",
        mean: "遗憾。",
        regex: "(?<=无)憾(?=，)",
    },
    {
        name: "王道",
        mean: "以仁义治天下，这是儒家的政治主张。与当时诸侯奉行的以武力统一天下的“霸道”相对。",
        regex: "(?<=，)王道(?=之)",
    },
    {
        name: "树",
        mean: "种植。",
        regex: "(?<=，)树(?=之)",
    },
    {
        name: "衣帛",
        mean: "穿上丝织品的衣服。衣，用作动词，穿。",
        regex: "(?<=以)衣帛(?=矣)",
    },
    {
        name: "豚(tún):小猪。",
        mean: "undefined",
        regex: "(?<=鸡)豚(?=狗)",
    },
    {
        name: "彘(zhì):猪。",
        mean: "undefined",
        regex: "(?<=狗)彘(?=之)",
    },
    {
        name: "畜:畜养，饲养。",
        mean: "undefined",
        regex: "(?<=之)畜(?=，)",
    },
    {
        name: "百亩之田",
        mean: "古代实行井田制，一个男劳动力可分得耕田一百亩。",
        regex: "(?<=；)百亩之田(?=，)",
    },
    {
        name: "庠序",
        mean: "古代的乡学。庠，设在党中的学校。术，同“遂”，一万二千五百家为遂。序，设在遂中的学校。",
        regex: "(?<=谨)庠序(?=之)",
    },
    {
        name: "教",
        mean: "教化。",
        regex: "(?<=之)教(?=，)",
    },
    {
        name: "申",
        mean: "反复陈述。",
        regex: "(?<=，)申(?=之)",
    },
    {
        name: "孝悌",
        mean: "敬爱父母和兄长。悌(tì)。",
        regex: "(?<=以)孝悌(?=之)",
    },
    {
        name: "义",
        mean: "道理。",
        regex: "(?<=之)义(?=，)",
    },
    {
        name: "颁白",
        mean: "头发花白。颁，通“斑”。",
        regex: "(?<=，)颁白(?=者)",
    },
    {
        name: "负戴",
        mean: "负，背负着东西。戴，头顶着东西。",
        regex: "(?<=不)负戴(?=于)",
    },
    {
        name: "未之有",
        mean: "未有之。之，指代“七十者衣帛食肉，黎民不饥不寒，然而不王者”。",
        regex: "(?<=，)未之有(?=也)",
    },
    {
        name: "食人食",
        mean: "前一个“食”，动词，吃；后一个“食”，名词，指食物。",
        regex: "(?<=彘)食人食(?=而)",
    },
    {
        name: "检",
        mean: "检点，制止、约束。",
        regex: "(?<=知)检(?=，)",
    },
    {
        name: "涂",
        mean: "通“途”，道路。",
        regex: "(?<=，)涂(?=有)",
    },
    {
        name: "饿莩",
        mean: "饿死的人。莩(piǎo):同“殍”，饿死的人。",
        regex: "(?<=有)饿莩(?=而)",
    },
    {
        name: "发",
        mean: "指打开粮仓，赈济百姓。",
        regex: "(?<=知)发(?=，)",
    },
    {
        name: "岁",
        mean: "年岁、年成。",
        regex: "(?<=，)岁(?=也)",
    },
    {
        name: "罪",
        mean: "归咎，归罪。",
        regex: "(?<=无)罪(?=岁)",
    },
    {
        name: "斯",
        mean: "则、那么。",
        regex: "(?<=，)斯(?=天)",
    },
];

const content5 =
    "<h1>过秦论</h1>" +
    "<h3>【作者】贾谊 【朝代】汉</h3>" +
    "<p>秦孝公据崤函之固，拥雍州之地，君臣固守以窥周室，有席卷天下，包举宇内，囊括四海之意，并吞八荒之心。当是时也，商君佐之，内立法度，务耕织，修守战之具，外连衡而斗诸侯。于是秦人拱手而取西河之外。</p>" +
    "<p>孝公既没，惠文、武、昭襄蒙故业，因遗策，南取汉中，西举巴、蜀，东割膏腴之地，北收要害之郡。诸侯恐惧，会盟而谋弱秦，不爱珍器重宝肥饶之地，以致天下之士，合从缔交，相与为一。当此之时，齐有孟尝，赵有平原，楚有春申，魏有信陵。此四君者，皆明智而忠信，宽厚而爱人，尊贤而重士，约从离衡，兼韩、魏、燕、楚、齐、赵、宋、卫、中山之众。于是六国之士，有宁越、徐尚、苏秦、杜赫之属为之谋，齐明、周最、陈轸、召滑、楼缓、翟景、苏厉、乐毅之徒通其意，吴起、孙膑、带佗、倪良、王廖、田忌、廉颇、赵奢之伦制其兵。尝以十倍之地，百万之众，叩关而攻秦。秦人开关延敌，九国之师，逡巡而不敢进。秦无亡矢遗镞之费，而天下诸侯已困矣。于是从散约败，争割地而赂秦。秦有余力而制其弊，追亡逐北，伏尸百万，流血漂橹；因利乘便，宰割天下，分裂山河。强国请服，弱国入朝。</p>" +
    "<p>延及孝文王、庄襄王，享国之日浅，国家无事。</p>" +
    "<p>及至始皇，奋六世之余烈，振长策而御宇内，吞二周而亡诸侯，履至尊而制六合，执敲扑而鞭笞天下，威振四海。南取百越之地，以为桂林、象郡；百越之君，俯首系颈，委命下吏。乃使蒙恬北筑长城而守藩篱，却匈奴七百余里；胡人不敢南下而牧马，士不敢弯弓而报怨。于是废先王之道，焚百家之言，以愚黔首；隳名城，杀豪杰；收天下之兵，聚之咸阳，销锋镝，铸以为金人十二，以弱天下之民。然后践华为城，因河为池，据亿丈之城，临不测之渊，以为固。良将劲弩守要害之处，信臣精卒陈利兵而谁何。天下已定，始皇之心，自以为关中之固，金城千里，子孙帝王万世之业也。</p>" +
    "<p>始皇既没，余威震于殊俗。然陈涉瓮牖绳枢之子，氓隶之人，而迁徙之徒也；才能不及中人，非有仲尼，墨翟之贤，陶朱、猗顿之富；蹑足行伍之间，而倔起阡陌之中，率疲弊之卒，将数百之众，转而攻秦；斩木为兵，揭竿为旗，天下云集响应，赢粮而景从。山东豪俊遂并起而亡秦族矣。</p>" +
    "<p>且夫天下非小弱也，雍州之地，崤函之固，自若也。陈涉之位，非尊于齐、楚、燕、赵、韩、魏、宋、卫、中山之君也；锄櫌棘矜，非铦于钩戟长铩也；谪戍之众，非抗于九国之师也；深谋远虑，行军用兵之道，非及向时之士也。然而成败异变，功业相反，何也？试使山东之国与陈涉度长絜大，比权量力，则不可同年而语矣。然秦以区区之地，致万乘之势，序八州而朝同列，百有余年矣；然后以六合为家，崤函为宫；一夫作难而七庙隳，身死人手，为天下笑者，何也？仁义不施而攻守之势异也。</p>"


const words5 = [
    {
        name: '窥',
        mean: '窥视，偷看。这里是伺机夺取的意思。',
        regex: '(?<=以)窥(?=周)'
    },
    {
        name: '席卷',
        mean: '并吞，像卷席子那样全部卷了去。',
        regex: '(?<=有)席卷(?=天)'
    },
    {
        name: '包举',
        mean: '并吞，像用布包东西那样整个地裹了去。',
        regex: '(?<=，)包举(?=宇)'
    },
    {
        name: '囊括',
        mean: '并吞。像用袋子装东西那样搜括干净。',
        regex: '(?<=，)囊括(?=四)'
    },
    {
        name: '务',
        mean: '从事，致力于。',
        regex: '(?<=，)务(?=耕)'
    },
    {
        name: '斗',
        mean: '使动用法，使……争斗。',
        regex: '(?<=而)斗(?=诸)'
    },
    {
        name: '拱手',
        mean: '两手合抱，比喻很轻松的样子。',
        regex: '(?<=人)拱手(?=而)'
    },
    {
        name: '没',
        mean: '通“殁”，死。',
        regex: '(?<=既)没(?=，)'
    },
    {
        name: '蒙',
        mean: '继承，蒙受。',
        regex: '(?<=襄)蒙(?=故)'
    },
    {
        name: '因',
        mean: '动词，沿袭。',
        regex: '(?<=，)因(?=遗)'
    },
    {
        name: '弱',
        mean: '使动用法，使……弱。',
        regex: '(?<=谋)弱(?=秦)'
    },
    {
        name: '于是',
        mean: '在这时。',
        regex: '(?<=。)于是(?=六)'
    },
    {
        name: '制',
        mean: '管理，统率。',
        regex: '(?<=伦)制(?=其)'
    },
    {
        name: '叩',
        mean: '攻击。',
        regex: '(?<=，)叩(?=关)'
    },
    {
        name: '延',
        mean: '迎接，指迎战。',
        regex: '(?<=关)延(?=敌)'
    },
    {
        name: '北',
        mean: '败走的军队。',
        regex: '(?<=逐)北(?=，)'
    },
    {
        name: '奋',
        mean: '发扬。',
        regex: '(?<=，)奋(?=六)'
    },
    {
        name: '烈',
        mean: '功业。',
        regex: '(?<=余)烈(?=，)'
    },
    {
        name: '履至尊',
        mean: '登帝位。履，登上。至尊，天子之位。',
        regex: '(?<=，)履至尊(?=而)'
    },
    {
        name: '以为',
        mean: '以之为，把……设为。',
        regex: '(?<=，)以为(?=桂)'
    },
    {
        name: '却',
        mean: '使动用法，使……退却。',
        regex: '(?<=，)却(?=匈)'
    },
    {
        name: '愚',
        mean: '使动用法，使……变得愚昧。',
        regex: '(?<=以)愚(?=黔)'
    },
    {
        name: '践',
        mean: '登，引申为依仗。',
        regex: '(?<=后)践(?=华)'
    },
    {
        name: '因',
        mean: '凭借。',
        regex: '(?<=，)因(?=河)'
    },
    {
        name: '固',
        mean: '形容词作名词，险固的地方。',
        regex: '(?<=之)固(?=，)'
    },
    {
        name: '贤',
        mean: '形容词作名词，品德与才干。',
        regex: '(?<=之)贤(?=，)'
    },
    {
        name: '蹑足',
        mean: '用脚踏地。这里有“投身于……”的意思。',
        regex: '(?<=；)蹑足(?=行)'
    },
    {
        name: '赢',
        mean: '担负。',
        regex: '(?<=，)赢(?=粮)'
    },
    {
        name: '景',
        mean: '通“影”，名词作状语，像影子一样。',
        regex: '(?<=而)景(?=从)'
    },
    {
        name: '抗',
        mean: '通“亢”，高，引申为强大。',
        regex: '(?<=非)抗(?=于)'
    },
    {
        name: '向时',
        mean: '先前。',
        regex: '(?<=及)向时(?=之)'
    },
    {
        name: '序',
        mean: '名词作动词，安排次序，引申为统制。',
        regex: '(?<=，)序(?=八)'
    },
]

const content6 = 
    "<h1>鸿门宴</h1>" +
    "<h3>【作者】司马迁 【朝代】汉</h3>" +
    "<p>沛公军霸上，未得与项羽相见。沛公左司马曹无伤使人言于项羽曰：“沛公欲王关中，使子婴为相，珍宝尽有之。”项羽大怒曰：“旦日飨士卒，为击破沛公军！”当是时，项羽兵四十万，在新丰鸿门；沛公兵十万，在霸上。范增说项羽曰：“沛公居山东时，贪于财货，好美姬。今入关，财物无所取，妇女无所幸，此其志不在小。吾令人望其气，皆为龙虎，成五彩，此天子气也。急击勿失！”</p>" +
    "<p>楚左尹项伯者，项羽季父也，素善留侯张良。张良是时从沛公，项伯乃夜驰之沛公军，私见张良，具告以事，欲呼张良与俱去，曰：“毋从俱死也。”张良曰：“臣为韩王送沛公，沛公今事有急，亡去不义，不可不语。”良乃入，具告沛公。沛公大惊，曰：“为之奈何？”张良曰：“谁为大王为此计者？”曰：“鲰生说我曰：‘距关，毋内诸侯，秦地可尽王也。’故听之。”良曰：“料大王士卒足以当项王乎？”沛公默然，曰：“固不如也。且为之奈何？”张良曰：“请往谓项伯，言沛公不敢背项王也。”沛公曰：“君安与项伯有故？”张良曰：“秦时与臣游，项伯杀人，臣活之；今事有急，故幸来告良。”沛公曰：“孰与君少长？”良曰：“长于臣。”沛公曰：“君为我呼入，吾得兄事之。”张良出，要项伯。项伯即入见沛公。沛公奉卮酒为寿，约为婚姻，曰：“吾入关，秋毫不敢有所近，籍吏民，封府库，而待将军。所以遣将守关者，备他盗之出入与非常也。日夜望将军至，岂敢反乎！愿伯具言臣之不敢倍德也。”项伯许诺，谓沛公曰：“旦日不可不蚤自来谢项王。”沛公曰：“诺。”于是项伯复夜去，至军中，具以沛公言报项王。因言曰：“沛公不先破关中，公岂敢入乎？今人有大功而击之，不义也。不如因善遇之。”项王许诺。</p>" +
    "<p>沛公旦日从百余骑来见项王，至鸿门，谢曰：“臣与将军戮力而攻秦，将军战河北，臣战河南，然不自意能先入关破秦，得复见将军于此。今者有小人之言，令将军与臣有郤。”项王曰：“此沛公左司马曹无伤言之。不然，籍何以至此。”项王即日因留沛公与饮。项王、项伯东向坐；亚父南向坐，——亚父者，范增也；沛公北向坐；张良西向侍。范增数目项王，举所佩玉玦以示之者三，项王默然不应。范增起，出，召项庄，谓曰：“君王为人不忍。若入前为寿，寿毕，请以剑舞，因击沛公于坐，杀之。不者，若属皆且为所虏！”庄则入为寿。寿毕，曰：“君王与沛公饮，军中无以为乐，请以剑舞。”项王曰：“诺。”项庄拔剑起舞。项伯亦拔剑起舞，常以身翼蔽沛公，庄不得击。</p>" +
    "<p>于是张良至军门见樊哙。樊哙曰：“今日之事何如？”良曰：“甚急！今者项庄拔剑舞，其意常在沛公也。”哙曰：“此迫矣！臣请入，与之同命。”哙即带剑拥盾入军门。交戟之卫士欲止不内。樊哙侧其盾以撞，卫士仆地。哙遂入，披帷西向立，瞋目视项王，头发上指，目眦尽裂。项王按剑而跽曰：“客何为者？”张良曰：“沛公之参乘樊哙者也。”项王曰：“壮士！——赐之卮酒。”则与斗卮酒。哙拜谢，起，立而饮之。项王曰：“赐之彘肩。”则与一生彘肩。樊哙覆其盾于地，加彘肩上，拔剑切而啖之。项王曰：“壮士！能復饮乎？”樊哙曰：“臣死且不避，卮酒安足辞！夫秦王有虎狼之心，杀人如不能举，刑人如恐不胜，天下皆叛之。怀王与诸将约曰：‘先破秦入咸阳者王之。’今沛公先破秦入咸阳，毫毛不敢有所近，封闭宫室，还军霸上，以待大王来。故遣将守关者，备他盗出入与非常也。劳苦而功高如此，未有封侯之赏，而听细说，欲诛有功之人，此亡秦之续耳。窃为大王不取也！”项王未有以应，曰：“坐。”樊哙从良坐。</p>" +
    "<p>坐须臾，沛公起如厕，因招樊哙出。沛公已出，项王使都尉陈平召沛公。沛公曰：“今者出，未辞也，为之奈何？”樊哙曰：“大行不顾细谨，大礼不辞小让。如今人方为刀俎，我为鱼肉，何辞为？”于是遂去。乃令张良留谢。良问曰：“大王来何操？”曰：“我持白璧一双，欲献项王，玉斗一双，欲与亚父。会其怒，不敢献。公为我献之。”张良曰：“谨诺。”当是时，项王军在鸿门下，沛公军在霸上，相去四十里。沛公则置车骑，脱身独骑，与樊哙、夏侯婴、靳强、纪信等四人持剑盾步走，从郦山下，道芷阳间行。沛公谓张良曰：“从此道至吾军，不过二十里耳。度我至军中，公乃入。”</p>" +
    "<p>沛公已去，间至军中。张良入谢，曰：“沛公不胜桮杓，不能辞。谨使臣良奉白璧一双，再拜献大王足下，玉斗一双，再拜奉大将军足下。”项王曰：“沛公安在？”良曰：“闻大王有意督过之，脱身独去，已至军矣。”项王则受璧，置之坐上。亚父受玉斗，置之地，拔剑撞而破之，曰：“唉！竖子不足与谋！夺项王天下者必沛公也。吾属今为之虏矣！”</p>"+
    "<p>沛公至军，立诛杀曹无伤。</p>"

const words6 = [
    {
        name: '军',
        mean: '名词作动词，驻扎。',
        regex: '(?<=公)军(?=霸)'
    },
    {
        name: '使',
        mean: '派。',
        regex: '(?<=伤)使(?=人)'
    },
    {
        name: '王',
        mean: '名词作动词，称王。',
        regex: '(?<=欲)王(?=关)'
    },
    {
        name: '飨',
        mean: '犒劳。',
        regex: '(?<=日)飨(?=士)'
    },
    {
        name: '说',
        mean: '劝告。',
        regex: '(?<=增)说(?=项)'
    },
    {
        name: '善',
        mean: '与......交好。',
        regex: '(?<=素)善(?=留)'
    },
    {
        name: '夜',
        mean: '名词作状语，连夜。',
        regex: '(?<=乃)夜(?=驰)'
    },
    {
        name: '去',
        mean: '离开。',
        regex: '(?<=俱)去(?=，)'
    },
    {
        name: '具',
        mean: '详细。',
        regex: '(?<=，)具(?=告)'
    },
    {
        name: '为',
        mean: '制定。',
        regex: '(?<=王)为(?=此)'
    },
    {
        name: '距',
        mean: '通“拒”，把守。',
        regex: '(?<=‘)距(?=关)'
    },
    {
        name: '内',
        mean: '通“纳”，接纳。',
        regex: '(?<=毋)内(?=诸)'
    },
    {
        name: '谓',
        mean: '告诉。',
        regex: '(?<=往)谓(?=项)'
    },
    {
        name: '要',
        mean: '通“邀”，邀请。',
        regex: '(?<=，)要(?=项)'
    },
    {
        name: '婚姻',
        mean: '亲家。',
        regex: '(?<=为)婚姻(?=，)'
    },
    {
        name: '近',
        mean: '沾染。 ',
        regex: '(?<=所)近(?=，)'
    },
    {
        name: '所以',
        mean: '......的原因',
        regex: '(?<=。)所以(?=遣)'
    },
    {
        name: '非常',
        mean: '意外的事故。',
        regex: '(?<=与)非常(?=也)'
    },
    {
        name: '倍',
        mean: '通“背”，背叛。',
        regex: '(?<=敢)倍(?=德)'
    },
    {
        name: '因',
        mean: '趁机。',
        regex: '(?<=。)因(?=言)'
    },
    {
        name: '从',
        mean: '使......跟从，带领。',
        regex: '(?<=日)从(?=百)'
    },
    {
        name: '意',
        mean: '料想。',
        regex: '(?<=自)意(?=能)'
    },
    {
        name: '目',
        mean: '使眼色。',
        regex: '(?<=数)目(?=项)'
    },
    {
        name: '同命',
        mean: '拼命。',
        regex: '(?<=之)同命(?=。)'
    },
    {
        name: '啖',
        mean: '吃。',
        regex: '(?<=而)啖(?=之)'
    },
    {
        name: '足',
        mean: '值得。',
        regex: '(?<=安)足(?=辞)'
    },
    {
        name: '王',
        mean: '使......称王。',
        regex: '(?<=者)王(?=之)'
    },
    {
        name: '细说',
        mean: '谗言。',
        regex: '(?<=听)细说(?=，)'
    },
    {
        name: '会',
        mean: '正赶上，恰逢。',
        regex: '(?<=。)会(?=其)'
    },
    {
        name: '度',
        mean: '估计。',
        regex: '(?<=。)度(?=我)'
    },
    {
        name: '胜',
        mean: '禁得起。',
        regex: '(?<=不)胜(?=桮)'
    },
    {
        name: '置',
        mean: '放弃，丢下。',
        regex: '(?<=，)置(?=之)'
    },
]

const dict = {
    '1-1': {
        'content': content1,
        'words': words1,
    },
    '1-2': {
        'content': content2,
        'words': words2,
    },
    '1-3': {
        'content': content3,
        'words': words3,
    },
    '1-4': {
        'content': content4,
        'words': words4,
    },
    '2-1': {
        'content': content5,
        'words': words5,
    },
    '2-2': {
        'content': content6,
        'words': words6,
    }
}

export function getWords(order: string) {
    return dict[order as keyof typeof dict]['words']
}

export function words(order: string) {
    let words = dict[order as keyof typeof dict]['words']
    let content = dict[order as keyof typeof dict]['content'];
    for (let i = 0; i < words?.length; i++) {
        let regex = new RegExp(words[i].regex);
        // console.log(regex)
        content = content.replace(
            regex,
            `<span id=${i} class="high-light">${words[i].name}<\/span>`
        );
    }
    // console.log(content1)
    // console.log(React.createElement('div','',content1))
    return content;
}
