import React from "react";

interface dict {
    '1-1': object,
    '1-2': object,
    '1-3': object,
    '1-4': object,
    '2-1': object,
    '2-2': object,
    '2-3': object,
    '2-4': object,
    '3-1': object,
    '3-2': object,
    '3-3': object,
    '3-4': object,
    '4-1': object,
    '4-2': object,
    '4-3': object,
    '4-4': object,
}

const content1 =
    "<h1>烛之武退秦师</h1>" +
    "<h3>【作者】左丘明 【朝代】先秦</h3>" +
    "<p>晋侯、秦伯围郑，以其无礼于晋，且贰于楚也。晋军函陵，秦军氾南。</p>" +
    "<p>佚之狐言于郑伯曰：“国危矣，若使烛之武见秦君，师必退。”公从之。辞曰：“臣之壮也，犹不如人；今老矣，无能为也已。”公曰：“吾不能早用子，今急而求子，是寡人之过也。然郑亡，子亦有不利焉。”许之。</p>" +
    "<p>夜缒而出，见秦伯，曰：“秦、晋围郑，郑既知亡矣。若亡郑而有益于君，敢以烦执事。越国以鄙远，君知其难也。焉用亡郑以陪邻？邻之厚，君之薄也。若舍郑以为东道主，行李之往来，共其乏困，君亦无所害。且君尝为晋君赐矣，许君焦、瑕，朝济而夕设版焉，君之所知也。夫晋，何厌之有？既东封郑，又欲肆其西封，若不阙秦，将焉取之？阙秦以利晋，唯君图之。”秦伯说，与郑人盟。使杞子、逢孙、杨孙戍之，乃还。</p>" +
    "<p>子犯请击之，公曰：“不可。微夫人之力不及此。因人之力而敝之，不仁；失其所与，不知；以乱易整，不武。吾其还也。”亦去之。</p>";

const words1 = [
    {
        name: "以",
        mean: "连词，因为。",
        regex: "(?<=，)以(?=其)",
    },
    {
        name: "无礼",
        mean: "形容词作动词，对……无礼。",
        regex: "(?<=其)无礼(?=于)",
    },
    {
        name: "贰",
        mean: "从属二主。",
        regex: "(?<=且)贰(?=于)",
    },
    {
        name: "军",
        mean: "名词作动词，驻军。",
        regex: "(?<=晋)军(?=函)",
    },
    {
        name: "师",
        mean: "军队。",
        regex: "(?<=，)师(?=必)",
    },
    {
        name: "从",
        mean: "同意。",
        regex: "(?<=公)从(?=之)",
    },
    {
        name: "已",
        mean: "同“矣”。",
        regex: "(?<=也)已(?=。)",
    },
    {
        name: "而",
        mean: "表因果。",
        regex: "(?<=急)而(?=求)",
    },
    {
        name: "缒",
        mean: "用绳子拴着人（或物）从上往下送。",
        regex: "(?<=夜)缒(?=而)",
    },
    {
        name: "执事",
        mean: "办事的官吏，对对方的敬称。",
        regex: "(?<=烦)执事(?=。)",
    },
    {
        name: "鄙远",
        mean: "名词作动词，把……作为边邑",
        regex: "(?<=以)鄙远(?=，)",
    },
    {
        name: "焉用亡郑以陪邻",
        mean: "为什么要灭掉郑国而给邻国增加土地呢。焉",
        regex: "(?<=。)焉用亡郑以陪邻(?=？)",
    },
    {
        name: "舍",
        mean: "放弃(围郑)。",
        regex: "(?<=若)舍(?=郑)",
    },
    {
        name: "东道主",
        mean: "东边道路上的主人。",
        regex: "(?<=为)东道主(?=，)",
    },
    {
        name: "行李",
        mean: "出使的人。",
        regex: "(?<=，)行李(?=之)",
    },
    {
        name: "共",
        mean: "通“供”，供给。",
        regex: "(?<=，)共(?=其)",
    },
    {
        name: "乏困",
        mean: "缺乏的物资。",
        regex: "(?<=其)乏困(?=，)",
    },
    {
        name: "为",
        mean: "给予。",
        regex: "(?<=尝)为(?=晋)",
    },
    {
        name: "朝济而夕设版焉",
        mean: "指晋惠公早上渡过黄河回国，晚上就修筑防御工事。济，渡河。设版，修筑防御工事。版，筑土墙用的夹板。",
        regex: "(?<=，)朝济而夕设版焉(?=，)",
    },
    {
        name: "何厌之有",
        mean: "有何厌之，有什么满足的呢。厌，满足。",
        regex: "(?<=，)何厌之有(?=？)",
    },
    {
        name: "肆",
        mean: "延伸，扩张。",
        regex: "(?<=欲)肆(?=其)",
    },
    {
        name: "图",
        mean: "考虑。",
        regex: "(?<=君)图(?=之)",
    },
    {
        name: "敝",
        mean: "损害。",
        regex: "(?<=而)敝(?=之)",
    },
    {
        name: "与",
        mean: "结交，亲附。",
        regex: "(?<=所)与(?=，)",
    },
];

const content2 =
    "<h1>邹忌讽齐王纳谏</h1>" +
    "<h3>【作者】《战国策》 【朝代】先秦</h3>" +
    "<p>邹忌修八尺有余，而形貌昳丽。朝服衣冠，窥镜，谓其妻曰：“我孰与城北徐公美？”其妻曰：“君美甚，徐公何能及君也？”城北徐公，齐国之美丽者也。忌不自信，而复问其妾曰：“吾孰与徐公美？”妾曰：“徐公何能及君也？”旦日，客从外来，与坐谈，问之客曰：“吾与徐公孰美？”客曰：“徐公不若君之美也。”明日徐公来，孰视之，自以为不如；窥镜而自视，又弗如远甚。暮寝而思之，曰：“吾妻之美我者，私我也；妾之美我者，畏我也；客之美我者，欲有求于我也。”</p>" +
    "<p>于是入朝见威王，曰：“臣诚知不如徐公美。臣之妻私臣，臣之妾畏臣，臣之客欲有求于臣，皆以美于徐公。今齐地方千里，百二十城，宫妇左右莫不私王，朝廷之臣莫不畏王，四境之内莫不有求于王：由此观之，王之蔽甚矣。”</p>" +
    "<p>王曰：“善。”乃下令：“群臣吏民能面刺寡人之过者，受上赏；上书谏寡人者，受中赏；能谤讥于市朝，闻寡人之耳者，受下赏。”令初下，群臣进谏，门庭若市；数月之后，时时而间进；期年之后，虽欲言，无可进者。燕、赵、韩、魏闻之，皆朝于齐。此所谓战胜于朝廷。</p>";

const words2 = [
    {
        name: "讽",
        mean: "讽谏，用暗示，比喻之类的方法，委婉的规劝。",
        regex: "(?<=忌)讽(?=齐)",
    },
    {
        name: "修",
        mean: "身长。",
        regex: "(?<=忌)修(?=八)",
    },
    {
        name: "昳丽",
        mean: "光艳美丽。",
        regex: "(?<=貌)昳丽(?=。)",
    },
    {
        name: "服",
        mean: "名词作状语，穿戴。",
        regex: "(?<=朝)服(?=衣)",
    },
    {
        name: "窥镜",
        mean: "照镜子。",
        regex: "(?<=，)窥镜(?=，)",
    },
    {
        name: "与",
        mean: "和。",
        regex: "(?<=孰)与(?=城)",
    },
    {
        name: "与坐谈",
        mean: "省略句，与之坐谈。",
        regex: "(?<=，)与坐谈(?=，)",
    },
    {
        name: "寝",
        mean: "躺着。",
        regex: "(?<=暮)寝(?=而)",
    },
    {
        name: "美",
        mean: "形容词意动用法，以……为美。",
        regex: "(?<=之)美(?=我)",
    },
    {
        name: "私",
        mean: "动词，偏爱。",
        regex: "(?<=，)私(?=我)",
    },
    {
        name: "美",
        mean: "形容词意动用法，以……为美。",
        regex: "(?<=之)美(?=我)",
    },
    {
        name: "地方",
        mean: "地，土地，疆域。方，方圆。",
        regex: "(?<=齐)地方(?=千)",
    },
    {
        name: "左右",
        mean: "身边的近臣。",
        regex: "(?<=妇)左右(?=莫)",
    },
    {
        name: "蔽",
        mean: "形容词作动词，受蒙蔽。",
        regex: "(?<=之)蔽(?=甚)",
    },
    {
        name: "面刺",
        mean: "当面指责。",
        regex: "(?<=能)面刺(?=寡)",
    },
    {
        name: "受",
        mean: "通“授”，给予，付予。",
        regex: "(?<=，)受(?=上)",
    },
    {
        name: "谤讥于市朝",
        mean: "在公众场所议论（君王的过失）。谤，公开指责别人的过错。讥，讽喻。谤讥，在这里指“指责，议论”，没有贬意。市朝，众人集聚的公共场所。",
        regex: "(?<=能)谤讥于市朝(?=，)",
    },
    {
        name: "闻",
        mean: "动词使动用法，使……听到。",
        regex: "(?<=，)闻(?=寡)",
    },
    {
        name: "时时而间进",
        mean: "有时候偶然进谏。间进，偶然有人进谏。间，间或，偶然，有时候。",
        regex: "(?<=，)时时而间进(?=；)",
    },
    {
        name: "期年",
        mean: "满一年。",
        regex: "(?<=；)期年(?=之)",
    },
    {
        name: "此所谓战胜于朝廷",
        mean: "这就是身居朝廷，不必用兵，就战胜了敌国。",
        regex: "(?<=。)此所谓战胜于朝廷(?=。)",
    },
];

const content3 =
    "<h1>子路曾皙冉有公西华侍坐</h1>" +
    "<p>子路、曾皙、冉有、公西华侍坐。</p>" +
    "<p>子曰：“以吾一日长乎尔，毋吾以也。居则曰：‘不吾知也。’如或知尔，则何以哉？”</p>" +
    "<p>子路率尔而对曰：“千乘之国，摄乎大国之间，加之以师旅，因之以饥馑；由也为之，比及三年，可使有勇，且知方也。”</p>" +
    "<p>夫子哂之。</p>" +
    "<p>“求，尔何如？”</p>" +
    "<p>对曰：“方六七十，如五六十，求也为之，比及三年，可使足民。如其礼乐，以俟君子。”</p>" +
    "<p>“赤，尔何如？”</p>" +
    "<p>对曰：“非曰能之，愿学焉。宗庙之事，如会同，端章甫，愿为小相焉。”</p>" +
    "<p>“点，尔何如？”</p>" +
    "<p>鼓瑟希，铿尔，舍瑟而作，对曰：“异乎三子者之撰。”</p>" +
    "<p>子曰：“何伤乎？亦各言其志也！”</p>" +
    "<p>曰：“莫春者，春服既成，冠者五六人，童子六七人，浴乎沂，风乎舞雩，咏而归。”</p>" +
    "<p>夫子喟然叹曰：“吾与点也。”</p>" +
    "<p>三子者出，曾皙后。曾皙曰：“夫三子者之言何如？”</p>" +
    "<p>子曰：“亦各言其志也已矣！”</p>" +
    "<p>曰：“夫子何哂由也？”</p>" +
    "<p>曰：“为国以礼，其言不让，是故哂之。”</p>" +
    "<p>“唯求则非邦也与？”</p>" +
    "<p>“安见方六七十，如五六十而非邦也者？”</p>" +
    "<p>“唯赤则非邦也与？”</p>" +
    "<p>“宗庙会同，非诸侯而何？赤也为之小，孰能为之大？”</p>";

const words3 = [
    {
        name: "侍",
        mean: "侍奉, 本指侍立于尊者之旁。",
        regex: "(?<=华)侍(?=坐)",
    },
    {
        name: "以吾一日长乎尔",
        mean: "以， 因为。长，年长。",
        regex: "(?<=“)以吾一日长乎尔(?=，)",
    },
    {
        name: "毋吾以也",
        mean: "吾，作“以 ”的宾语，在否定句中代词宾语前置。以，同“已”， 是“止”的意思。毋，不要。",
        regex: "(?<=，)毋吾以也(?=。)",
    },
    {
        name: "居则曰",
        mean: "（你们）平日说。 居，平日，平时。",
        regex: "(?<=。)居则曰(?=：)",
    },
    {
        name: "不吾知",
        mean: "即＂不知吾＂，不了解我。",
        regex: "(?<=‘)不吾知(?=也)",
    },
    {
        name: "何以",
        mean: "用什么（去实现自己的抱负）。以，动词，用。",
        regex: "(?<=则)何以(?=哉)",
    },
    {
        name: "率尔",
        mean: "急遽而不加考虑的样子。尔，相当于 “然”，……的样子。",
        regex: "(?<=路)率尔(?=而)",
    },
    {
        name: "千乘之国",
        mean: "有一千辆兵车的诸侯国。在春秋后期 ，千乘之国是中等国家。乘，兵车。古时一车四马为一乘。春秋时，一辆兵车配甲士3人，步卒72人。",
        regex: "(?<=“)千乘之国(?=，)",
    },
    {
        name: "摄乎大国之间",
        mean: "摄，夹处。乎，于，在。",
        regex: "(?<=，)摄乎大国之间(?=，)",
    },
    {
        name: "加之以师旅",
        mean: "有（别国的）军队来攻打它；加，加在上面；师旅，指军队，此特指侵略的军队。古时两千五百人为一师，五百人为一旅。",
        regex: "(?<=，)加之以师旅(?=，)",
    },
    {
        name: "因之以饥馑",
        mean: "接连下来（国内） 又有饥荒。因，接续；饥馑，泛指饥荒。",
        regex: "(?<=，)因之以饥馑(?=；)",
    },
    {
        name: "为之",
        mean: "治理这个国家。为，治。",
        regex: "(?<=也)为之(?=，)",
    },
    {
        name: "比及",
        mean: "等到。",
        regex: "(?<=，)比及(?=三)",
    },
    {
        name: "哂",
        mean: "微笑。",
        regex: "(?<=子)哂(?=之)",
    },
    {
        name: "足",
        mean: "使动用法，使……富足。",
        regex: "(?<=使)足(?=民)",
    },
    {
        name: "俟",
        mean: "等待。",
        regex: "(?<=以)俟(?=君)",
    },
    {
        name: "能",
        mean: "动词，能做到，胜任。",
        regex: "(?<=曰)能(?=之)",
    },
    {
        name: "会同",
        mean: "会，诸侯会盟。同，诸侯共同朝见天子。",
        regex: "(?<=如)会同(?=，)",
    },
    {
        name: "端章甫",
        mean: "穿着礼服，戴着礼帽。端，古代的一种礼帽。章甫，古代的一种礼服。这里都是名词用作动词。",
        regex: "(?<=，)端章甫(?=，)",
    },
    {
        name: "相",
        mean: "在祭祀、会盟或朝见天子时主持赞礼和司仪的人。",
        regex: "(?<=小)相(?=焉)",
    },
    {
        name: "希",
        mean: "同“稀”，稀疏，这里指鼓瑟的声音已接近尾声。",
        regex: "(?<=瑟)希(?=，)",
    },
    {
        name: "舍",
        mean: "放下。",
        regex: "(?<=，)舍(?=瑟)",
    },
    {
        name: "作",
        mean: "立起来，站起身。",
        regex: "(?<=而)作(?=，)",
    },
    {
        name: "撰",
        mean: "才具，才能。",
        regex: "(?<=之)撰(?=。)",
    },
    {
        name: "伤",
        mean: "妨害。",
        regex: "(?<=何)伤(?=乎)",
    },
    {
        name: "莫春者，春服既成",
        mean: "莫春，指农历三月；莫，通“暮”；既，副词，已经。",
        regex: "(?<=“)莫春者，春服既成(?=，)",
    },
    {
        name: "冠者五六人，童子六七人",
        mean: "几个成人，几个孩子；五六，六七，都是虚数。冠，古时男子二十岁为成年，束发加冠。",
        regex: "(?<=，)冠者五六人，童子六七人(?=，)",
    },
    {
        name: "喟然",
        mean: "叹息的样子。",
        regex: "(?<=子)喟然(?=叹)",
    },
    {
        name: "后",
        mean: "动词，后出。",
        regex: "(?<=皙)后(?=。)",
    },
    {
        name: "夫子何哂由也",
        mean: "何，为什么。",
        regex: "(?<=“)夫子何哂由也(?=？)",
    },
    {
        name: "为国以礼，其言不让",
        mean: "要用礼来治理国家，可他说话却不知道谦虚。以，介词。靠， 用；让，礼让，谦逊。",
        regex: "(?<=“)为国以礼，其言不让(?=，)",
    },
    {
        name: "唯求则非邦也与",
        mean: "唯，难道；邦，国家，这是指国家大事；与，同“欤”，疑问语气词。",
        regex: "(?<=“)唯赤则非邦也与(?=？)",
    },
];


const content4 =
    "<h1>寡人之于国也</h1>" +
    "<p>梁惠王曰：“寡人之于国也，尽心焉耳矣。河内凶，则移其民于河东，移其粟于河内；河东凶亦然。察邻国之政，无如寡人之用心者。邻国之民不加少，寡人之民不加多，何也？”</p>" +
    "<p>孟子对曰：“王好战，请以战喻。填然鼓之，兵刃既接，弃甲曳兵而走。或百步而后止，或五十步而后止。以五十步笑百步，则何如？”</p>" +
    "<p>梁惠王曰：“不可，直不百步耳，是亦走也。”</p>" +
    "<p>孟子曰：“王如知此，则无望民之多于邻国也。”</p>" +
    "<p>“不违农时，谷不可胜食也；数罟不入洿池，鱼鳖不可胜食也；斧斤以时入山林，材木不可胜用也。谷与鱼鳖不可胜食，材木不可胜用，是使民养生丧死无憾也。养生丧死无憾，王道之始也。”</p>" +
    "<p>“五亩之宅，树之以桑，五十者可以衣帛矣；鸡豚狗彘之畜，无失其时，七十者可以食肉矣；百亩之田，勿夺其时，数口之家可以无饥矣；谨庠序之教，申之以孝悌之义，颁白者不负戴于道路矣。七十者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。”</p>" +
    "<p>“狗彘食人食而不知检，涂有饿莩而不知发，人死，则曰：‘非我也，岁也。’是何异于刺人而杀之，曰：‘非我也，兵也。’？王无罪岁，斯天下之民至焉。”</p>";

const words4 = [
    {
        name: "寡人",
        mean: "寡德之人。是古代国君对自己的谦称。",
        regex: "(?<=“)寡人(?=之)",
    },
    {
        name: "焉耳矣",
        mean: "焉、耳、矣都是句末助词，重叠使用，加重语气。",
        regex: "(?<=心)焉耳矣(?=。)",
    },
    {
        name: "河内",
        mean: "今河南境内黄河以北的地方。古人以中原地区为中心，所以黄河以北称河内，黄河以南称河外。",
        regex: "(?<=内)凶(?=，)",
    },
    {
        name: "凶",
        mean: "谷物收成不好,荒年。",
        regex: "(?<=其)粟(?=于)",
    },
    {
        name: "河东",
        mean: "黄河以东的地方。在今山西西南部。黄河流经山西省境，自北而南，故称山西境内黄河以东的地区为河东。",
        regex: "(?<=于)河内(?=；)",
    },
    {
        name: "粟",
        mean: "谷子，脱壳后称为小米，也泛指谷类。",
        regex: "(?<=；)河东(?=凶)",
    },
    {
        name: "亦然",
        mean: "也是这样。",
        regex: "(?<=凶)亦然(?=。)",
    },
    {
        name: "无如",
        mean: "没有像……。",
        regex: "(?<=，)无如(?=寡)",
    },
    {
        name: "加少",
        mean: "更少。下文“加多”，更多。加，副词，更、再。",
        regex: "(?<=不)加少(?=，)",
    },
    {
        name: "填",
        mean: "拟声词，模拟鼓声。",
        regex: "(?<=。)填(?=然)",
    },
    {
        name: "鼓之",
        mean: "敲起鼓来，发动进攻。古人击鼓进攻，鸣锣退兵。鼓，动词。之，没有实在意义的衬字。",
        regex: "(?<=然)鼓之(?=，)",
    },
    {
        name: "兵刃既接",
        mean: "两军的兵器已经接触，指战斗已开始。兵，兵器、武器。既，已经。接，接触，交锋。",
        regex: "(?<=，)兵刃既接(?=，)",
    },
    {
        name: "弃甲曳兵",
        mean: "抛弃铠甲，拖着兵器。曳，yè，拖着。",
        regex: "(?<=，)弃甲曳兵(?=而)",
    },
    {
        name: "走",
        mean: "跑，这里指逃跑。",
        regex: "(?<=而)走(?=。)",
    },
    {
        name: "直",
        mean: "只是、不过。",
        regex: "(?<=，)直(?=不)",
    },
    {
        name: "不违农时",
        mean: "指农忙时不要征调百姓服役。违，违背、违反，这里指耽误。",
        regex: "(?<=“)不违农时(?=，)",
    },
    {
        name: "谷不可胜食",
        mean: "粮食吃不完。谷，粮食的统称。胜，尽。",
        regex: "(?<=，)谷不可胜食(?=也)",
    },
    {
        name: "数罟不入洿池",
        mean: "这是为了防止破坏鱼的生长和繁殖。数(cù)，密。罟(gǔ)，网。洿(wū)，深。",
        regex: "(?<=；)数罟不入洿池(?=，)",
    },
    {
        name: "斤",
        mean: "与斧相似，比斧小而刃横。",
        regex: "(?<=斧)斤(?=以)",
    },
    {
        name: "时",
        mean: "时令季节。砍伐树木宜于在草木凋落，生长季节过后的秋冬时节进行。",
        regex: "(?<=以)时(?=入)",
    },
    {
        name: "养生丧死",
        mean: "养生，供养活着的人。丧死，为死了的人办丧事。",
        regex: "(?<=。)养生丧死(?=无)",
    },
    {
        name: "憾",
        mean: "遗憾。",
        regex: "(?<=无)憾(?=，)",
    },
    {
        name: "王道",
        mean: "以仁义治天下，这是儒家的政治主张。与当时诸侯奉行的以武力统一天下的“霸道”相对。",
        regex: "(?<=，)王道(?=之)",
    },
    {
        name: "树",
        mean: "种植。",
        regex: "(?<=，)树(?=之)",
    },
    {
        name: "衣帛",
        mean: "穿上丝织品的衣服。衣，用作动词，穿。",
        regex: "(?<=以)衣帛(?=矣)",
    },
    {
        name: "豚",
        mean: "豚(tún):小猪。",
        regex: "(?<=鸡)豚(?=狗)",
    },
    {
        name: "彘",
        mean: "彘(zhì):猪。",
        regex: "(?<=狗)彘(?=之)",
    },
    {
        name: "畜",
        mean: "畜养，饲养。",
        regex: "(?<=之)畜(?=，)",
    },
    {
        name: "百亩之田",
        mean: "古代实行井田制，一个男劳动力可分得耕田一百亩。",
        regex: "(?<=；)百亩之田(?=，)",
    },
    {
        name: "庠序",
        mean: "古代的乡学。庠，设在党中的学校。术，同“遂”，一万二千五百家为遂。序，设在遂中的学校。",
        regex: "(?<=谨)庠序(?=之)",
    },
    {
        name: "教",
        mean: "教化。",
        regex: "(?<=之)教(?=，)",
    },
    {
        name: "申",
        mean: "反复陈述。",
        regex: "(?<=，)申(?=之)",
    },
    {
        name: "孝悌",
        mean: "敬爱父母和兄长。悌(tì)。",
        regex: "(?<=以)孝悌(?=之)",
    },
    {
        name: "义",
        mean: "道理。",
        regex: "(?<=之)义(?=，)",
    },
    {
        name: "颁白",
        mean: "头发花白。颁，通“斑”。",
        regex: "(?<=，)颁白(?=者)",
    },
    {
        name: "负戴",
        mean: "负，背负着东西。戴，头顶着东西。",
        regex: "(?<=不)负戴(?=于)",
    },
    {
        name: "未之有",
        mean: "未有之。之，指代“七十者衣帛食肉，黎民不饥不寒，然而不王者”。",
        regex: "(?<=，)未之有(?=也)",
    },
    {
        name: "食人食",
        mean: "前一个“食”，动词，吃；后一个“食”，名词，指食物。",
        regex: "(?<=彘)食人食(?=而)",
    },
    {
        name: "检",
        mean: "检点，制止、约束。",
        regex: "(?<=知)检(?=，)",
    },
    {
        name: "涂",
        mean: "通“途”，道路。",
        regex: "(?<=，)涂(?=有)",
    },
    {
        name: "饿莩",
        mean: "饿死的人。莩(piǎo):同“殍”，饿死的人。",
        regex: "(?<=有)饿莩(?=而)",
    },
    {
        name: "发",
        mean: "指打开粮仓，赈济百姓。",
        regex: "(?<=知)发(?=，)",
    },
    {
        name: "岁",
        mean: "年岁、年成。",
        regex: "(?<=，)岁(?=也)",
    },
    {
        name: "罪",
        mean: "归咎，归罪。",
        regex: "(?<=无)罪(?=岁)",
    },
    {
        name: "斯",
        mean: "则、那么。",
        regex: "(?<=，)斯(?=天)",
    },
];

const content5 =
    "<h1>过秦论</h1>" +
    "<h3>【作者】贾谊 【朝代】汉</h3>" +
    "<p>秦孝公据崤函之固，拥雍州之地，君臣固守以窥周室，有席卷天下，包举宇内，囊括四海之意，并吞八荒之心。当是时也，商君佐之，内立法度，务耕织，修守战之具，外连衡而斗诸侯。于是秦人拱手而取西河之外。</p>" +
    "<p>孝公既没，惠文、武、昭襄蒙故业，因遗策，南取汉中，西举巴、蜀，东割膏腴之地，北收要害之郡。诸侯恐惧，会盟而谋弱秦，不爱珍器重宝肥饶之地，以致天下之士，合从缔交，相与为一。当此之时，齐有孟尝，赵有平原，楚有春申，魏有信陵。此四君者，皆明智而忠信，宽厚而爱人，尊贤而重士，约从离衡，兼韩、魏、燕、楚、齐、赵、宋、卫、中山之众。于是六国之士，有宁越、徐尚、苏秦、杜赫之属为之谋，齐明、周最、陈轸、召滑、楼缓、翟景、苏厉、乐毅之徒通其意，吴起、孙膑、带佗、倪良、王廖、田忌、廉颇、赵奢之伦制其兵。尝以十倍之地，百万之众，叩关而攻秦。秦人开关延敌，九国之师，逡巡而不敢进。秦无亡矢遗镞之费，而天下诸侯已困矣。于是从散约败，争割地而赂秦。秦有余力而制其弊，追亡逐北，伏尸百万，流血漂橹；因利乘便，宰割天下，分裂山河。强国请服，弱国入朝。</p>" +
    "<p>延及孝文王、庄襄王，享国之日浅，国家无事。</p>" +
    "<p>及至始皇，奋六世之余烈，振长策而御宇内，吞二周而亡诸侯，履至尊而制六合，执敲扑而鞭笞天下，威振四海。南取百越之地，以为桂林、象郡；百越之君，俯首系颈，委命下吏。乃使蒙恬北筑长城而守藩篱，却匈奴七百余里；胡人不敢南下而牧马，士不敢弯弓而报怨。于是废先王之道，焚百家之言，以愚黔首；隳名城，杀豪杰；收天下之兵，聚之咸阳，销锋镝，铸以为金人十二，以弱天下之民。然后践华为城，因河为池，据亿丈之城，临不测之渊，以为固。良将劲弩守要害之处，信臣精卒陈利兵而谁何。天下已定，始皇之心，自以为关中之固，金城千里，子孙帝王万世之业也。</p>" +
    "<p>始皇既没，余威震于殊俗。然陈涉瓮牖绳枢之子，氓隶之人，而迁徙之徒也；才能不及中人，非有仲尼，墨翟之贤，陶朱、猗顿之富；蹑足行伍之间，而倔起阡陌之中，率疲弊之卒，将数百之众，转而攻秦；斩木为兵，揭竿为旗，天下云集响应，赢粮而景从。山东豪俊遂并起而亡秦族矣。</p>" +
    "<p>且夫天下非小弱也，雍州之地，崤函之固，自若也。陈涉之位，非尊于齐、楚、燕、赵、韩、魏、宋、卫、中山之君也；锄櫌棘矜，非铦于钩戟长铩也；谪戍之众，非抗于九国之师也；深谋远虑，行军用兵之道，非及向时之士也。然而成败异变，功业相反，何也？试使山东之国与陈涉度长絜大，比权量力，则不可同年而语矣。然秦以区区之地，致万乘之势，序八州而朝同列，百有余年矣；然后以六合为家，崤函为宫；一夫作难而七庙隳，身死人手，为天下笑者，何也？仁义不施而攻守之势异也。</p>"


const words5 = [
    {
        name: '窥',
        mean: '窥视，偷看。这里是伺机夺取的意思。',
        regex: '(?<=以)窥(?=周)'
    },
    {
        name: '席卷',
        mean: '并吞，像卷席子那样全部卷了去。',
        regex: '(?<=有)席卷(?=天)'
    },
    {
        name: '包举',
        mean: '并吞，像用布包东西那样整个地裹了去。',
        regex: '(?<=，)包举(?=宇)'
    },
    {
        name: '囊括',
        mean: '并吞。像用袋子装东西那样搜括干净。',
        regex: '(?<=，)囊括(?=四)'
    },
    {
        name: '务',
        mean: '从事，致力于。',
        regex: '(?<=，)务(?=耕)'
    },
    {
        name: '斗',
        mean: '使动用法，使……争斗。',
        regex: '(?<=而)斗(?=诸)'
    },
    {
        name: '拱手',
        mean: '两手合抱，比喻很轻松的样子。',
        regex: '(?<=人)拱手(?=而)'
    },
    {
        name: '没',
        mean: '通“殁”，死。',
        regex: '(?<=既)没(?=，)'
    },
    {
        name: '蒙',
        mean: '继承，蒙受。',
        regex: '(?<=襄)蒙(?=故)'
    },
    {
        name: '因',
        mean: '动词，沿袭。',
        regex: '(?<=，)因(?=遗)'
    },
    {
        name: '弱',
        mean: '使动用法，使……弱。',
        regex: '(?<=谋)弱(?=秦)'
    },
    {
        name: '于是',
        mean: '在这时。',
        regex: '(?<=。)于是(?=六)'
    },
    {
        name: '制',
        mean: '管理，统率。',
        regex: '(?<=伦)制(?=其)'
    },
    {
        name: '叩',
        mean: '攻击。',
        regex: '(?<=，)叩(?=关)'
    },
    {
        name: '延',
        mean: '迎接，指迎战。',
        regex: '(?<=关)延(?=敌)'
    },
    {
        name: '北',
        mean: '败走的军队。',
        regex: '(?<=逐)北(?=，)'
    },
    {
        name: '奋',
        mean: '发扬。',
        regex: '(?<=，)奋(?=六)'
    },
    {
        name: '烈',
        mean: '功业。',
        regex: '(?<=余)烈(?=，)'
    },
    {
        name: '履至尊',
        mean: '登帝位。履，登上。至尊，天子之位。',
        regex: '(?<=，)履至尊(?=而)'
    },
    {
        name: '以为',
        mean: '以之为，把……设为。',
        regex: '(?<=，)以为(?=桂)'
    },
    {
        name: '却',
        mean: '使动用法，使……退却。',
        regex: '(?<=，)却(?=匈)'
    },
    {
        name: '愚',
        mean: '使动用法，使……变得愚昧。',
        regex: '(?<=以)愚(?=黔)'
    },
    {
        name: '践',
        mean: '登，引申为依仗。',
        regex: '(?<=后)践(?=华)'
    },
    {
        name: '因',
        mean: '凭借。',
        regex: '(?<=，)因(?=河)'
    },
    {
        name: '固',
        mean: '形容词作名词，险固的地方。',
        regex: '(?<=之)固(?=，)'
    },
    {
        name: '贤',
        mean: '形容词作名词，品德与才干。',
        regex: '(?<=之)贤(?=，)'
    },
    {
        name: '蹑足',
        mean: '用脚踏地。这里有“投身于……”的意思。',
        regex: '(?<=；)蹑足(?=行)'
    },
    {
        name: '赢',
        mean: '担负。',
        regex: '(?<=，)赢(?=粮)'
    },
    {
        name: '景',
        mean: '通“影”，名词作状语，像影子一样。',
        regex: '(?<=而)景(?=从)'
    },
    {
        name: '抗',
        mean: '通“亢”，高，引申为强大。',
        regex: '(?<=非)抗(?=于)'
    },
    {
        name: '向时',
        mean: '先前。',
        regex: '(?<=及)向时(?=之)'
    },
    {
        name: '序',
        mean: '名词作动词，安排次序，引申为统制。',
        regex: '(?<=，)序(?=八)'
    },
]

const content6 =
    "<h1>鸿门宴</h1>" +
    "<h3>【作者】司马迁 【朝代】汉</h3>" +
    "<p>沛公军霸上，未得与项羽相见。沛公左司马曹无伤使人言于项羽曰：“沛公欲王关中，使子婴为相，珍宝尽有之。”项羽大怒曰：“旦日飨士卒，为击破沛公军！”当是时，项羽兵四十万，在新丰鸿门；沛公兵十万，在霸上。范增说项羽曰：“沛公居山东时，贪于财货，好美姬。今入关，财物无所取，妇女无所幸，此其志不在小。吾令人望其气，皆为龙虎，成五彩，此天子气也。急击勿失！”</p>" +
    "<p>楚左尹项伯者，项羽季父也，素善留侯张良。张良是时从沛公，项伯乃夜驰之沛公军，私见张良，具告以事，欲呼张良与俱去，曰：“毋从俱死也。”张良曰：“臣为韩王送沛公，沛公今事有急，亡去不义，不可不语。”良乃入，具告沛公。沛公大惊，曰：“为之奈何？”张良曰：“谁为大王为此计者？”曰：“鲰生说我曰：‘距关，毋内诸侯，秦地可尽王也。’故听之。”良曰：“料大王士卒足以当项王乎？”沛公默然，曰：“固不如也。且为之奈何？”张良曰：“请往谓项伯，言沛公不敢背项王也。”沛公曰：“君安与项伯有故？”张良曰：“秦时与臣游，项伯杀人，臣活之；今事有急，故幸来告良。”沛公曰：“孰与君少长？”良曰：“长于臣。”沛公曰：“君为我呼入，吾得兄事之。”张良出，要项伯。项伯即入见沛公。沛公奉卮酒为寿，约为婚姻，曰：“吾入关，秋毫不敢有所近，籍吏民，封府库，而待将军。所以遣将守关者，备他盗之出入与非常也。日夜望将军至，岂敢反乎！愿伯具言臣之不敢倍德也。”项伯许诺，谓沛公曰：“旦日不可不蚤自来谢项王。”沛公曰：“诺。”于是项伯复夜去，至军中，具以沛公言报项王。因言曰：“沛公不先破关中，公岂敢入乎？今人有大功而击之，不义也。不如因善遇之。”项王许诺。</p>" +
    "<p>沛公旦日从百余骑来见项王，至鸿门，谢曰：“臣与将军戮力而攻秦，将军战河北，臣战河南，然不自意能先入关破秦，得复见将军于此。今者有小人之言，令将军与臣有郤。”项王曰：“此沛公左司马曹无伤言之。不然，籍何以至此。”项王即日因留沛公与饮。项王、项伯东向坐；亚父南向坐，——亚父者，范增也；沛公北向坐；张良西向侍。范增数目项王，举所佩玉玦以示之者三，项王默然不应。范增起，出，召项庄，谓曰：“君王为人不忍。若入前为寿，寿毕，请以剑舞，因击沛公于坐，杀之。不者，若属皆且为所虏！”庄则入为寿。寿毕，曰：“君王与沛公饮，军中无以为乐，请以剑舞。”项王曰：“诺。”项庄拔剑起舞。项伯亦拔剑起舞，常以身翼蔽沛公，庄不得击。</p>" +
    "<p>于是张良至军门见樊哙。樊哙曰：“今日之事何如？”良曰：“甚急！今者项庄拔剑舞，其意常在沛公也。”哙曰：“此迫矣！臣请入，与之同命。”哙即带剑拥盾入军门。交戟之卫士欲止不内。樊哙侧其盾以撞，卫士仆地。哙遂入，披帷西向立，瞋目视项王，头发上指，目眦尽裂。项王按剑而跽曰：“客何为者？”张良曰：“沛公之参乘樊哙者也。”项王曰：“壮士！——赐之卮酒。”则与斗卮酒。哙拜谢，起，立而饮之。项王曰：“赐之彘肩。”则与一生彘肩。樊哙覆其盾于地，加彘肩上，拔剑切而啖之。项王曰：“壮士！能復饮乎？”樊哙曰：“臣死且不避，卮酒安足辞！夫秦王有虎狼之心，杀人如不能举，刑人如恐不胜，天下皆叛之。怀王与诸将约曰：‘先破秦入咸阳者王之。’今沛公先破秦入咸阳，毫毛不敢有所近，封闭宫室，还军霸上，以待大王来。故遣将守关者，备他盗出入与非常也。劳苦而功高如此，未有封侯之赏，而听细说，欲诛有功之人，此亡秦之续耳。窃为大王不取也！”项王未有以应，曰：“坐。”樊哙从良坐。</p>" +
    "<p>坐须臾，沛公起如厕，因招樊哙出。沛公已出，项王使都尉陈平召沛公。沛公曰：“今者出，未辞也，为之奈何？”樊哙曰：“大行不顾细谨，大礼不辞小让。如今人方为刀俎，我为鱼肉，何辞为？”于是遂去。乃令张良留谢。良问曰：“大王来何操？”曰：“我持白璧一双，欲献项王，玉斗一双，欲与亚父。会其怒，不敢献。公为我献之。”张良曰：“谨诺。”当是时，项王军在鸿门下，沛公军在霸上，相去四十里。沛公则置车骑，脱身独骑，与樊哙、夏侯婴、靳强、纪信等四人持剑盾步走，从郦山下，道芷阳间行。沛公谓张良曰：“从此道至吾军，不过二十里耳。度我至军中，公乃入。”</p>" +
    "<p>沛公已去，间至军中。张良入谢，曰：“沛公不胜桮杓，不能辞。谨使臣良奉白璧一双，再拜献大王足下，玉斗一双，再拜奉大将军足下。”项王曰：“沛公安在？”良曰：“闻大王有意督过之，脱身独去，已至军矣。”项王则受璧，置之坐上。亚父受玉斗，置之地，拔剑撞而破之，曰：“唉！竖子不足与谋！夺项王天下者必沛公也。吾属今为之虏矣！”</p>" +
    "<p>沛公至军，立诛杀曹无伤。</p>"

const words6 = [
    {
        name: '军',
        mean: '名词作动词，驻扎。',
        regex: '(?<=公)军(?=霸)'
    },
    {
        name: '使',
        mean: '派。',
        regex: '(?<=伤)使(?=人)'
    },
    {
        name: '王',
        mean: '名词作动词，称王。',
        regex: '(?<=欲)王(?=关)'
    },
    {
        name: '飨',
        mean: '犒劳。',
        regex: '(?<=日)飨(?=士)'
    },
    {
        name: '说',
        mean: '劝告。',
        regex: '(?<=增)说(?=项)'
    },
    {
        name: '善',
        mean: '与......交好。',
        regex: '(?<=素)善(?=留)'
    },
    {
        name: '夜',
        mean: '名词作状语，连夜。',
        regex: '(?<=乃)夜(?=驰)'
    },
    {
        name: '去',
        mean: '离开。',
        regex: '(?<=俱)去(?=，)'
    },
    {
        name: '具',
        mean: '详细。',
        regex: '(?<=，)具(?=告)'
    },
    {
        name: '为',
        mean: '制定。',
        regex: '(?<=王)为(?=此)'
    },
    {
        name: '距',
        mean: '通“拒”，把守。',
        regex: '(?<=‘)距(?=关)'
    },
    {
        name: '内',
        mean: '通“纳”，接纳。',
        regex: '(?<=毋)内(?=诸)'
    },
    {
        name: '谓',
        mean: '告诉。',
        regex: '(?<=往)谓(?=项)'
    },
    {
        name: '要',
        mean: '通“邀”，邀请。',
        regex: '(?<=，)要(?=项)'
    },
    {
        name: '婚姻',
        mean: '亲家。',
        regex: '(?<=为)婚姻(?=，)'
    },
    {
        name: '近',
        mean: '沾染。 ',
        regex: '(?<=所)近(?=，)'
    },
    {
        name: '所以',
        mean: '......的原因',
        regex: '(?<=。)所以(?=遣)'
    },
    {
        name: '非常',
        mean: '意外的事故。',
        regex: '(?<=与)非常(?=也)'
    },
    {
        name: '倍',
        mean: '通“背”，背叛。',
        regex: '(?<=敢)倍(?=德)'
    },
    {
        name: '因',
        mean: '趁机。',
        regex: '(?<=。)因(?=言)'
    },
    {
        name: '从',
        mean: '使......跟从，带领。',
        regex: '(?<=日)从(?=百)'
    },
    {
        name: '意',
        mean: '料想。',
        regex: '(?<=自)意(?=能)'
    },
    {
        name: '目',
        mean: '使眼色。',
        regex: '(?<=数)目(?=项)'
    },
    {
        name: '同命',
        mean: '拼命。',
        regex: '(?<=之)同命(?=。)'
    },
    {
        name: '啖',
        mean: '吃。',
        regex: '(?<=而)啖(?=之)'
    },
    {
        name: '足',
        mean: '值得。',
        regex: '(?<=安)足(?=辞)'
    },
    {
        name: '王',
        mean: '使......称王。',
        regex: '(?<=者)王(?=之)'
    },
    {
        name: '细说',
        mean: '谗言。',
        regex: '(?<=听)细说(?=，)'
    },
    {
        name: '会',
        mean: '正赶上，恰逢。',
        regex: '(?<=。)会(?=其)'
    },
    {
        name: '度',
        mean: '估计。',
        regex: '(?<=。)度(?=我)'
    },
    {
        name: '胜',
        mean: '禁得起。',
        regex: '(?<=不)胜(?=桮)'
    },
    {
        name: '置',
        mean: '放弃，丢下。',
        regex: '(?<=，)置(?=之)'
    },
]

const content7 =
    "<h1>师说</h1>" +
    "<h3>【作者】韩愈 【朝代】唐</h3>" +
    "<p>古之学者必有师。师者，所以传道受业解惑也。人非生而知之者，孰能无惑？惑而不从师，其为惑也，终不解矣。生乎吾前，其闻道也固先乎吾，吾从而师之；生乎吾后，其闻道也亦先乎吾，吾从而师之。吾师道也，夫庸知其年之先后生于吾乎？是故无贵无贱，无长无少，道之所存，师之所存也。</p>" +
    "<p>嗟乎！师道之不传也久矣！欲人之无惑也难矣！古之圣人，其出人也远矣，犹且从师而问焉；今之众人，其下圣人也亦远矣，而耻学于师。是故圣益圣，愚益愚。圣人之所以为圣，愚人之所以为愚，其皆出于此乎？爱其子，择师而教之；于其身也，则耻师焉，惑矣。彼童子之师，授之书而习其句读者，非吾所谓传其道解其惑者也。句读之不知，惑之不解，或师焉，或不焉，小学而大遗，吾未见其明也。巫医乐师百工之人，不耻相师。士大夫之族，曰师曰弟子云者，则群聚而笑之。问之，则曰：“彼与彼年相若也，道相似也。位卑则足羞，官盛则近谀。”呜呼！师道之不复可知矣。巫医乐师百工之人，君子不齿，今其智乃反不能及，其可怪也欤！</p>" +
    "<p>圣人无常师。孔子师郯子、苌弘、师襄、老聃。郯子之徒，其贤不及孔子。孔子曰：三人行，则必有我师。是故弟子不必不如师，师不必贤于弟子，闻道有先后，术业有专攻，如是而已。</p>"

const words7 = [
    {
        name: '受',
        mean: ' 这里同“授”，传授。',
        regex: '(?<=道)受(?=业)'
    },
    {
        name: '固',
        mean: ' 本来。',
        regex: '(?<=也)固(?=先)'
    },
    {
        name: '师',
        mean: ' 作动词用，以......为师。',
        regex: '(?<=而)师(?=之)'
    },
    {
        name: '师道',
        mean: ' 学习道理。',
        regex: '(?<=吾)师道(?=也)'
    },
    {
        name: '夫庸知其',
        mean: ' 哪里用得着问他的……。',
        regex: '(?<=，)夫庸知其(?=年)'
    },
    {
        name: '是故',
        mean: ' 因此，所以。',
        regex: '(?<=？)是故(?=无)'
    },
    {
        name: '出人',
        mean: ' 高于一般人。',
        regex: '(?<=其)出人(?=也)'
    },
    {
        name: '犹且',
        mean: ' 尚且，还。',
        regex: '(?<=，)犹且(?=从)'
    },
    {
        name: '耻',
        mean: '以......为耻。',
        regex: '(?<=则)耻(?=师)'
    },
    {
        name: '句读',
        mean: '指句子中间停顿的地方。读， 亦作“逗”。',
        regex: '(?<=其)句读(?=者)'
    },
    {
        name: '相师',
        mean: ' 向别人请教。',
        regex: '(?<=耻)相师(?=。)'
    },
    {
        name: '羞',
        mean: '感到羞耻。',
        regex: '(?<=足)羞(?=，)'
    },
    {
        name: '不齿',
        mean: '不屑（与之同列）。',
        regex: '(?<=子)不齿(?=，)'
    },
    {
        name: '常',
        mean: '固定的。',
        regex: '(?<=无)常(?=师)'
    },
    {
        name: '术业',
        mean: ' 学术和技能。',
        regex: '(?<=，)术业(?=有)'
    },
    {
        name: '嘉',
        mean: '嘉许，认可。',
        regex: '(?<=余)嘉(?=其)'
    },
    {
        name: '贻',
        mean: ' 赠。',
        regex: '(?<=以)贻(?=之)'
    },
]

const content8 =
    "<h1>阿房宫赋</h1>" +
    "<h3>【作者】杜牧 【朝代】唐</h3>" +
    "<p>六王毕，四海一；蜀山兀，阿房出。覆压三百余里，隔离天日。骊山北构而西折，直走咸阳。二川溶溶，流入宫墙。五步一楼，十步一阁；廊腰缦回，檐牙高啄；各抱地势，钩心斗角。盘盘焉，囷囷焉，蜂房水涡，矗不知其几千万落！长桥卧波，未云何龙？复道行空，不霁何虹？高低冥迷，不知西东。歌台暖响，春光融融；舞殿冷袖，风雨凄凄。一日之内，一宫之间，而气候不齐。</p>" +
    "<p>妃嫔媵嫱，王子皇孙，辞楼下殿，辇来于秦，朝歌夜弦，为秦宫人。明星荧荧，开妆镜也；绿云扰扰，梳晓鬟也；渭流涨腻，弃脂水也；烟斜雾横，焚椒兰也。雷霆乍惊，宫车过也；辘辘远听，杳不知其所之也。一肌一容，尽态极妍，缦立远视，而望幸焉；有不见者，三十六年。燕、赵之收藏，韩、魏之经营，齐、楚之精英，几世几年，剽掠其人，倚叠如山。一旦不能有，输来其间。鼎铛玉石，金块珠砾，弃掷逦迤，秦人视之，亦不甚惜。</p>" +
    "<p>嗟乎！一人之心，千万人之心也。秦爱纷奢，人亦念其家；奈何取之尽锱铢，用之如泥沙？使负栋之柱，多于南亩之农夫；架梁之椽，多于机上之工女；钉头磷磷，多于在庾之粟粒；瓦缝参差，多于周身之帛缕；直栏横槛，多于九土之城郭；管弦呕哑，多于市人之言语。使天下之人，不敢言而敢怒；独夫之心，日益骄固。戍卒叫，函谷举；楚人一炬，可怜焦土。呜呼！灭六国者，六国也，非秦也。族秦者，秦也，非天下也。嗟乎！使六国各爱其人，则足以拒秦；使秦复爱六国之人，则递三世可至万世而为君，谁得而族灭也？秦人不暇自哀，而后人哀之；后人哀之而不鉴之，亦使后人而复哀后人也。</p>"

const words8 = [
    {
        name: '毕',
        mean: '完了，指为秦国所灭。',
        regex: '(?<=王)毕(?=，)'
    },
    {
        name: '一',
        mean: '统一。',
        regex: '(?<=海)一(?=；)'
    },
    {
        name: '覆压',
        mean: '覆盖。',
        regex: '(?<=。)覆压(?=三)'
    },
    {
        name: '北',
        mean: '从......北边。',
        regex: '(?<=山)北(?=构)'
    },
    {
        name: '西',
        mean: '向西。',
        regex: '(?<=而)西(?=折)'
    },
    {
        name: '矗',
        mean: '形容建筑高高耸立的样子。',
        regex: '(?<=，)矗(?=不)'
    },
    {
        name: '冥迷',
        mean: '分辨不清。',
        regex: '(?<=低)冥迷(?=，)'
    },
    {
        name: '荧荧',
        mean: '形容明亮的样子。',
        regex: '(?<=星)荧荧(?=，)'
    },
    {
        name: '幸',
        mean: '宠幸。',
        regex: '(?<=望)幸(?=焉)'
    },
    {
        name: '收藏',
        mean: '指收藏的金银珍宝等。',
        regex: '(?<=之)收藏(?=，)'
    },
    {
        name: '精英',
        mean: '与收藏同义，指收藏的金银珍宝等。',
        regex: '(?<=之)精英(?=，)'
    },
    {
        name: '鼎铛玉石，金块珠砾',
        mean: '把宝鼎看作铁锅，把美玉看作石头，把黄金看作土块，把珍珠看作石子。',
        regex: '(?<=。)鼎铛玉石，金块珠砾(?=，)'
    },
    {
        name: '独夫',
        mean: '失去人心而极端独立的统治者。这里指秦始皇。',
        regex: '(?<=；)独夫(?=之)'
    },
    {
        name: '举',
        mean: '攻占。',
        regex: '(?<=谷)举(?=；)'
    },
    {
        name: '族',
        mean: '作动词用，灭族。',
        regex: '(?<=。)族(?=秦)'
    },
    {
        name: '递',
        mean: '传递，顺着次序传下。',
        regex: '(?<=则)递(?=三)'
    },
]

const content9 =
    "<h1>六国论</h1>" +
    "<h3>【作者】苏洵 【朝代】宋</h3>" +
    "<p>六国破灭，非兵不利 ，战不善，弊在赂秦。赂秦而力亏，破灭之道也。或曰：六国互丧，率赂秦耶？曰：不赂者以赂者丧，盖失强援，不能独完。故曰：弊在赂秦也。</p>" +
    "<p>秦以攻取之外，小则获邑，大则得城。较秦之所得，与战胜而得者，其实百倍；诸侯之所亡，与战败而亡者，其实亦百倍。则秦之所大欲，诸侯之所大患，固不在战矣。思厥先祖父，暴霜露，斩荆棘，以有尺寸之地。子孙视之不甚惜，举以予人，如弃草芥。今日割五城，明日割十城，然后得一夕安寝。起视四境，而秦兵又至矣。然则诸侯之地有限，暴秦之欲无厌，奉之弥繁，侵之愈急。故不战而强弱胜负已判矣。至于颠覆，理固宜然。古人云：“以地事秦，犹抱薪救火，薪不尽，火不灭。”此言得之。</p>" +
    "<p>齐人未尝赂秦，终继五国迁灭，何哉？与嬴而不助五国也。五国既丧，齐亦不免矣。燕赵之君，始有远略，能守其土，义不赂秦。是故燕虽小国而后亡，斯用兵之效也。至丹以荆卿为计，始速祸焉。赵尝五战于秦，二败而三胜。后秦击赵者再，李牧连却之。洎牧以谗诛，邯郸为郡，惜其用武而不终也。且燕赵处秦革灭殆尽之际，可谓智力孤危，战败而亡，诚不得已。向使三国各爱其地，齐人勿附于秦，刺客不行，良将犹在，则胜负之数，存亡之理，当与秦相较，或未易量。</p>" +
    "<p>呜呼！以赂秦之地封天下之谋臣，以事秦之心礼天下之奇才，并力西向，则吾恐秦人食之不得下咽也。悲夫！有如此之势，而为秦人积威之所劫，日削月割，以趋于亡。为国者无使为积威之所劫哉！</p>" +
    "<p>夫六国与秦皆诸侯，其势弱于秦，而犹有可以不赂而胜之之势。苟以天下之大，下而从六国破亡之故事，是又在六国下矣。</p>"

const words9 = [
    {
        name: '赂秦',
        mean: '以财物赠予秦国，这里指向秦割地求和。赂，赠送财物。',
        regex: '(?<=在)赂秦(?=。)'
    },
    {
        name: '或曰',
        mean: '有人说。这是设问。下句的“曰”是对设问的回答。',
        regex: '(?<=。)或曰(?=：)'
    },
    {
        name: '互丧',
        mean: '相继灭亡。',
        regex: '(?<=国)互丧(?=，)'
    },
    {
        name: '率',
        mean: '全都，一概。',
        regex: '(?<=，)率(?=赂)'
    },
    {
        name: '完',
        mean: '保全。',
        regex: '(?<=独)完(?=。)'
    },
    {
        name: '以攻取',
        mean: '用攻战（的方法）取得。',
        regex: '(?<=秦)以攻取(?=之)'
    },
    {
        name: '厥先祖父',
        mean: '他们的祖辈父辈。厥，相当于“其”。祖父，泛指祖辈、父辈。',
        regex: '(?<=思)厥先祖父(?=，)'
    },
    {
        name: '暴霜露',
        mean: '暴露在霜露之中。和下文的“斩荆棘”连起来，形容创业的艰苦。暴，同“曝”。',
        regex: '(?<=，)暴霜露(?=，)'
    },
    {
        name: '举以予人',
        mean: '拿来送给别人。',
        regex: '(?<=，)举以予人(?=，)'
    },
    {
        name: '奉之弥繁，侵之愈急',
        mean: '六国送给秦越多，秦侵犯六国越厉害。',
        regex: '(?<=，)奉之弥繁，侵之愈急(?=。)'
    },
    {
        name: '判',
        mean: '决定，确定。',
        regex: '(?<=已)判(?=矣)'
    },
    {
        name: '迁灭',
        mean: '灭亡。',
        regex: '(?<=国)迁灭(?=，)'
    },
    {
        name: '与赢',
        mean: '亲附秦国。与，亲附、亲近。',
        regex: '(?<=？)与嬴(?=而)'
    },
    {
        name: '远略',
        mean: '长远的谋略。',
        regex: '(?<=有)远略(?=，)'
    },
    {
        name: '速',
        mean: '招致。',
        regex: '(?<=始)速(?=祸)'
    },
    {
        name: '洎',
        mean: '及，等到。',
        regex: '(?<=。)洎(?=牧)'
    },
    {
        name: '三国',
        mean: '指韩、魏、楚三国。这三国都曾经割地赂秦。',
        regex: '(?<=使)三国(?=各)'
    },
    {
        name: '胜负之数，存亡之理',
        mean: '胜败存亡的命运。数、理，指天数、命运。',
        regex: '(?<=则)胜负之数，存亡之理(?=，)'
    },
    {
        name: '较',
        mean: '较量。',
        regex: '(?<=相)较(?=，)'
    },
    {
        name: '积威',
        mean: '积久而成的威势。',
        regex: '(?<=人)积威(?=之)'
    },
    {
        name: '劫',
        mean: '胁迫，挟持。',
        regex: '(?<=所)劫(?=，)'
    },
    {
        name: '为国者',
        mean: '治理国家的人。',
        regex: '(?<=。)为国者(?=无)'
    },
    {
        name: '下',
        mean: '降低身份。',
        regex: '(?<=，)下(?=而)'
    },
    {
        name: '故事',
        mean: '旧事。',
        regex: '(?<=之)故事(?=，)'
    },
]

const content10 =
    "<h1>游褒禅山记</h1>" +
    "<h3>【作者】王安石 【朝代】宋</h3>" +
    "<p>褒禅山亦谓之华山。唐浮图慧褒始舍于其址，而卒葬之；以故其后名之曰“褒禅”。今所谓慧空禅院者，褒之庐冢也。距其院东五里，所谓华山洞者，以其乃华山之阳名之也。距洞百余步，有碑仆道，其文漫灭，独其为文犹可识，曰“花山”。今言“华”如“华实”之“华”者，盖音谬也。</p>" +
    "<p>其下平旷，有泉侧出，而记游者甚众，所谓前洞也。由山以上五六里，有穴窈然，入之甚寒，问其深，则其好游者不能穷也，谓之后洞。余与四人拥火以入，入之愈深，其进愈难，而其见愈奇。有怠而欲出者，曰：“不出，火且尽。”遂与之俱出。盖余所至，比好游者尚不能十一，然视其左右，来而记之者已少。盖其又深，则其至又加少矣。方是时，余之力尚足以入，火尚足以明也。既其出，则或咎其欲出者，而余亦悔其随之而不得极夫游之乐也。</p>" +
    "<p>于是余有叹焉。古人之观于天地、山川、草木、虫鱼、鸟兽，往往有得，以其求思之深而无不在也。夫夷以近，则游者众；险以远，则至者少。而世之奇伟、瑰怪，非常之观，常在于险远，而人之所罕至焉，故非有志者不能至也。有志矣，不随以止也，然力不足者，亦不能至也。有志与力，而又不随以怠，至于幽暗昏惑而无物以相之，亦不能至也。然力足以至焉，于人为可讥，而在己为有悔；尽吾志也而不能至者，可以无悔矣，其孰能讥之乎？此余之所得也。</p>" +
    "<p>余于仆碑，又以悲夫古书之不存，后世之谬其传而莫能名者，何可胜道也哉！此所以学者不可以不深思而慎取之也。</p>" +
    "<p>四人者：庐陵萧君圭君玉，长乐王回深父，余弟安国平父、安上纯父。至和元年七月某日，临川王某记。</p>"

const words10 = [
    {
        name: '浮图',
        mean: '梵（fàn）语（古印度语）音译词，也写作“浮屠”或“佛图”，本意是佛或佛教徒，这里指和尚。',
        regex: '(?<=唐)浮图(?=慧)'
    },
    {
        name: '舍',
        mean: '名词活用作动词，建舍定居。',
        regex: '(?<=始)舍(?=于)'
    },
    {
        name: '址',
        mean: '地基，基部，基址，这里指山脚。',
        regex: '(?<=其)址(?=，)'
    },
    {
        name: '以故',
        mean: '因此。',
        regex: '(?<=；)以故(?=其)'
    },
    {
        name: '庐冢',
        mean: '庐，屋舍。（一说指慧褒生前的屋舍)冢，坟墓。',
        regex: '(?<=之)庐冢(?=也)'
    },
    {
        name: '以其乃华山之阳名之',
        mean: '以，因为。乃，表示判断，有“为”、“是”的意思。阳，山的南面。古代称山的南面、水的北面为“阳”，山的背面、水的南面为“阴”。名，命名，动词。',
        regex: '(?<=，)以其乃华山之阳名之(?=也)'
    },
    {
        name: '仆道',
        mean: '“仆（于）道”的省略，倒在路旁。',
        regex: '(?<=碑)仆道(?=，)'
    },
    {
        name: '漫灭',
        mean: '指因风化剥落而模糊不清。',
        regex: '(?<=文)漫灭(?=，)'
    },
    {
        name: '侧出',
        mean: '从旁边涌出。',
        regex: '(?<=泉)侧出(?=，)'
    },
    {
        name: '记游',
        mean: '指在洞壁上题诗文留念。',
        regex: '(?<=而)记游(?=者)'
    },
    {
        name: '由山以上',
        mean: '上，名词活用作动词，向上走。',
        regex: '(?<=。)由山以上(?=五)'
    },
    {
        name: '窈然',
        mean: '深远幽暗的样子。',
        regex: '(?<=穴)窈然(?=，)'
    },
    {
        name: '问其深',
        mean: '问，探究，追究。深',
        regex: '(?<=，)问其深(?=，)'
    },
    {
        name: '则其好游者不能穷',
        mean: '则，副词，用于判断句表示肯定,相当于“就”。穷，穷尽。',
        regex: '(?<=，)则其好游者不能穷也(?=，)'
    },
    {
        name: '拥火以入',
        mean: '拥火，拿着火把。拥，持，拿。以，连词，连接状语与中心词。',
        regex: '(?<=人)拥火以入(?=，)'
    },
    {
        name: '见',
        mean: '动词活用作名词，见到的景象。',
        regex: '(?<=其)见(?=愈)'
    },
    {
        name: '怠',
        mean: '懈怠。',
        regex: '(?<=有)怠(?=而)'
    },
    {
        name: '且',
        mean: '副词，将，将要。',
        regex: '(?<=火)且(?=尽)'
    },
    {
        name: '尚不能十一',
        mean: '尚，还。不能十一，不及十分之一。不能，不及，不到。',
        regex: '(?<=者)尚不能十一(?=，)'
    },
    {
        name: '而',
        mean: '表递进的连词，并且，而且。',
        regex: '(?<=来)而(?=记)'
    },
    {
        name: '至',
        mean: '动词活用作名词，到达的人。',
        regex: '(?<=其)至(?=又)'
    },
    {
        name: '方是时',
        mean: '正当这个时候。',
        regex: '(?<=。)方是时(?=，)'
    },
    {
        name: '足以明',
        mean: '以，相当于“而”，连词，连接状语与中心词。明，形容词或用作动词，照明。',
        regex: '(?<=尚)足以明(?=也)'
    },
    {
        name: '既其出',
        mean: '既，已经，……以后。其，助词。',
        regex: '(?<=。)既其出(?=，)'
    },
    {
        name: '或',
        mean: '有人。',
        regex: '(?<=则)或(?=咎)'
    },
    {
        name: '其',
        mean: '第一人称代词，指自己。',
        regex: '(?<=悔)其(?=随)'
    },
    {
        name: '之',
        mean: '用于主谓之间，取消句子的独立性，可不译。',
        regex: '(?<=人)之(?=观)'
    },
    {
        name: '得',
        mean: '得，心得，收获。',
        regex: '(?<=有)得(?=，)'
    },
    {
        name: '求思',
        mean: '探求、思索。',
        regex: '(?<=其)求思(?=之)'
    },
    {
        name: '夫夷以近',
        mean: '夫，表议论的发语词。夷',
        regex: '(?<=。)夫夷以近(?=，)'
    },
    {
        name: '非常之观',
        mean: '非同寻常的景象。',
        regex: '(?<=，)非常之观(?=，)'
    },
    {
        name: '险远',
        mean: '形容词活用作名词，险远的地方。',
        regex: '(?<=于)险远(?=，)'
    },
    {
        name: '幽暗昏惑',
        mean: '幽深昏暗，叫人迷乱（的地方）。昏惑，迷乱。',
        regex: '(?<=于)幽暗昏惑(?=而)'
    },
    {
        name: '无物以相',
        mean: '以，连词，表目的。相（xiàng），帮助，辅助。',
        regex: '(?<=而)无物以相(?=之)'
    },
    {
        name: '得',
        mean: '心得，收获。',
        regex: '(?<=所)得(?=也)'
    },
    {
        name: '以悲',
        mean: '以（之），因此。悲，叹息。',
        regex: '(?<=又)以悲(?=夫)'
    },
    {
        name: '谬',
        mean: '使……谬误，把……弄错。',
        regex: '(?<=之)谬(?=其)'
    },
    {
        name: '莫能名',
        mean: '不能说出真相（一说真名）。名，指识其本名，这里用做动词。',
        regex: '(?<=而)莫能名(?=者)'
    },
    {
        name: '何可胜道',
        mean: '怎么能说得完。胜，尽。',
        regex: '(?<=，)何可胜道(?=也)'
    },
    {
        name: '慎取',
        mean: '谨慎取舍。',
        regex: '(?<=而)慎取(?=之)'
    },
]

const content11 =
    "<h1>项脊轩志</h1>" +
    "<h3>【作者】归有光 【朝代】明</h3>" +
    "<p>项脊轩，旧南阁子也。室仅方丈，可容一人居。百年老屋，尘泥渗漉，雨泽下注；每移案，顾视，无可置者。又北向，不能得日，日过午已昏。余稍为修葺，使不上漏。前辟四窗，垣墙周庭，以当南日，日影反照，室始洞然。又杂植兰桂竹木于庭，旧时栏楯，亦遂增胜。借书满架，偃仰啸歌，冥然兀坐，万籁有声；而庭堦寂寂，小鸟时来啄食，人至不去。三五之夜，明月半墙，桂影斑驳，风移影动，珊珊可爱。</p>" +
    "<p>然余居于此，多可喜，亦多可悲。先是庭中通南北为一。迨诸父异爨，内外多置小门墙，往往而是。东犬西吠，客逾庖而宴，鸡栖于厅。庭中始为篱，已为墙，凡再变矣。家有老妪，尝居于此。妪，先大母婢也，乳二世，先妣抚之甚厚。室西连于中闺，先妣尝一至。妪每谓余曰：”某所，而母立于兹。”妪又曰：”汝姊在吾怀，呱呱而泣；娘以指叩门扉曰：‘儿寒乎？欲食乎？’吾从板外相为应答。”语未毕，余泣，妪亦泣。余自束发，读书轩中，一日，大母过余曰：”吾儿，久不见若影，何竟日默默在此，大类女郎也？”比去，以手阖门，自语曰：”吾家读书久不效，儿之成，则可待乎！”顷之，持一象笏至，曰：”此吾祖太常公宣德间执此以朝，他日汝当用之！”瞻顾遗迹，如在昨日，令人长号不自禁。然余居于此，多可喜，亦多可悲。先是庭中通南北为一。迨诸父异爨，内外多置小门墙，往往而是。东犬西吠，客逾庖而宴，鸡栖于厅。庭中始为篱，已为墙，凡再变矣。家有老妪，尝居于此。妪，先大母婢也，乳二世，先妣抚之甚厚。室西连于中闺，先妣尝一至。妪每谓余曰：”某所，而母立于兹。”妪又曰：”汝姊在吾怀，呱呱而泣；娘以指叩门扉曰：‘儿寒乎？欲食乎？’吾从板外相为应答。”语未毕，余泣，妪亦泣。余自束发，读书轩中，一日，大母过余曰：”吾儿，久不见若影，何竟日默默在此，大类女郎也？”比去，以手阖门，自语曰：”吾家读书久不效，儿之成，则可待乎！”顷之，持一象笏至，曰：”此吾祖太常公宣德间执此以朝，他日汝当用之！”瞻顾遗迹，如在昨日，令人长号不自禁。</p>" +
    "<p>轩东，故尝为厨，人往，从轩前过。余扃牖而居，久之，能以足音辨人。轩凡四遭火，得不焚，殆有神护者。</p>" +
    "<p>项脊生曰：“蜀清守丹穴，利甲天下，其后秦皇帝筑女怀清台；刘玄德与曹操争天下，诸葛孔明起陇中。方二人之昧昧于一隅也，世何足以知之，余区区处败屋中，方扬眉、瞬目，谓有奇景。人知之者，其谓与坎井之蛙何异？”</p>" +
    "<p> 余既为此志，后五年，吾妻来归，时至轩中，从余问古事，或凭几学书。吾妻归宁，述诸小妹语曰：”闻姊家有阁子，且何谓阁子也？”其后六年，吾妻死，室坏不修。其后二年，余久卧病无聊，乃使人复葺南阁子，其制稍异于前。然自后余多在外，不常居。</p>" +
    "<p> 庭有枇杷树，吾妻死之年所手植也，今已亭亭如盖矣。</p>"

const words11 = [
    {
        name: '项脊轩',
        mean: '归有光家的书斋名。',
        regex: '项脊轩(?=志)'
    },
    {
        name: '旧',
        mean: '旧日的，原来的。',
        regex: '(?<=，)旧(?=南)'
    },
    {
        name: '方丈',
        mean: '一丈见方。',
        regex: '(?<=仅)方丈(?=，)'
    },
    {
        name: '尘泥渗漉',
        mean: '（屋顶墙头上的）泥土漏下。',
        regex: '(?<=，)尘泥渗漉(?=，)'
    },
    {
        name: '雨泽下注',
        mean: '雨水往下倾泻。',
        regex: '(?<=，)雨泽下注(?=；)'
    },
    {
        name: '案',
        mean: '几案，桌子。',
        regex: '(?<=移)案(?=，)'
    },
    {
        name: '顾视',
        mean: '环看四周。',
        regex: '(?<=，)顾视(?=，)'
    },
    {
        name: '得日',
        mean: '照到阳光。',
        regex: '(?<=能)得日(?=，)'
    },
    {
        name: '昏',
        mean: '光线不明。',
        regex: '(?<=已)昏(?=。)'
    },
    {
        name: '修葺',
        mean: '修缮、修理，修补。',
        regex: '(?<=为)修葺(?=，)'
    },
    {
        name: '辟',
        mean: '开。',
        regex: '(?<=前)辟(?=四)'
    },
    {
        name: '垣墙周庭',
        mean: '庭院四周砌上围墙。',
        regex: '(?<=，)垣墙周庭(?=，)'
    },
    {
        name: '当',
        mean: '挡住。',
        regex: '(?<=以)当(?=南)'
    },
    {
        name: '洞然',
        mean: '明亮的样子。',
        regex: '(?<=始)洞然(?=。)'
    },
    {
        name: '栏楯',
        mean: '栏杆。纵的叫栏，横的叫楯。',
        regex: '(?<=时)栏楯(?=，)'
    },
    {
        name: '增胜',
        mean: '增添了光彩。',
        regex: '(?<=遂)增胜(?=。)'
    },
    {
        name: '偃',
        mean: '伏下。',
        regex: '(?<=，)偃(?=仰)'
    },
    {
        name: '啸歌',
        mean: '长啸或吟唱。文章指吟咏诗文，显示豪放自若。',
        regex: '(?<=仰)啸歌(?=，)'
    },
    {
        name: '冥然兀坐',
        mean: '静静地独自端坐着。',
        regex: '(?<=，)冥然兀坐(?=，)'
    },
    {
        name: '万籁有声',
        mean: '自然界的一切声音都能听到。',
        regex: '(?<=，)万籁有声(?=；)'
    },
    {
        name: '三五之夜',
        mean: '农历每月十五的夜晚。',
        regex: '(?<=。)三五之夜(?=，)'
    },
    {
        name: '珊珊',
        mean: '树影移动的样子。',
        regex: '(?<=，)珊珊(?=可)'
    },
    {
        name: '迨诸父异爨',
        mean: '等到伯、叔们分了家。',
        regex: '(?<=。)迨诸父异爨(?=，)'
    },
    {
        name: '往往',
        mean: '指到处，处处。',
        regex: '(?<=，)往往(?=而)'
    },
    {
        name: '东犬西吠',
        mean: '东边的狗对着西边叫。意思是分家后，狗把原住同一庭院的人当作陌生人。',
        regex: '(?<=。)东犬西吠(?=，)'
    },
    {
        name: '逾庖而宴',
        mean: '越过厨房而去吃饭。',
        regex: '(?<=客)逾庖而宴(?=，)'
    },
    {
        name: '已',
        mean: '已而，随后不久。',
        regex: '(?<=，)已(?=为)'
    },
    {
        name: '凡',
        mean: '总共。',
        regex: '(?<=，)凡(?=再)'
    },
    {
        name: '相为应答',
        mean: '一一回答。',
        regex: '(?<=外)相为应答(?=。)'
    },
    {
        name: '束发',
        mean: '古代男孩成童时束发为髻，岁前指儿童时代。',
        regex: '(?<=自)束发(?=，)'
    },
    {
        name: '竟日',
        mean: '一天到晚。',
        regex: '(?<=何)竟日(?=默)'
    },
    {
        name: '阖',
        mean: '通合，合上。',
        regex: '(?<=手)阖(?=门)'
    },
    {
        name: '瞻顾遗迹',
        mean: '回忆旧日事物。',
        regex: '(?<=”)瞻顾遗迹(?=，)'
    },
    {
        name: '扃牖',
        mean: '关着窗户。',
        regex: '(?<=余)扃牖(?=而)'
    },
    {
        name: '殆',
        mean: '恐怕。',
        regex: '(?<=，)殆(?=有)'
    },
    {
        name: '来归',
        mean: '嫁到我家来。',
        regex: '(?<=妻)来归(?=，)'
    },
    {
        name: '凭几学书',
        mean: '伏在几案上学写字。',
        regex: '(?<=或)凭几学书(?=。)'
    },
    {
        name: '归宁',
        mean: '出嫁的女儿回娘家省亲。',
        regex: '(?<=妻)归宁(?=，)'
    },
    {
        name: '制',
        mean: '指建造的格式和样子。',
        regex: '(?<=其)制(?=稍)'
    },
    {
        name: '手植',
        mean: '亲手种植。',
        regex: '(?<=所)手植(?=也)'
    },
    {
        name: '亭亭如盖',
        mean: '高高挺立，树冠像伞盖一样。盖，古称伞。',
        regex: '(?<=如)盖(?=矣)'
    }
]

const content12 =
    "<h1>五人墓碑记</h1>" +
    "<h3>【作者】张溥 【朝代】明</h3>" +
    "<p>五人者，盖当蓼洲周公之被逮，激于义而死焉者也。至于今，郡之贤士大夫请于当道，即除魏阉废祠之址以葬之；且立石于其墓之门，以旌其所为。呜呼，亦盛矣哉！</p>" +
    "<p>夫五人之死，去今之墓而葬焉，其为时止十有一月耳。夫十有一月之中，凡富贵之子，慷慨得志之徒，其疾病而死，死而湮没不足道者，亦已众矣；况草野之无闻者欤？独五人之皦皦，何也？</p>" +
    "<p>予犹记周公之被逮，在丙寅三月之望。吾社之行为士先者，为之声义，敛赀财以送其行，哭声震动天地。缇骑按剑而前，问：“谁为哀者？”众不能堪，抶而仆之。是时以大中丞抚吴者为魏之私人毛一鹭，公之逮所由使也；吴之民方痛心焉，于是乘其厉声以呵，则噪而相逐。中丞匿于溷藩以免。既而以吴民之乱请于朝，按诛五人，曰颜佩韦、杨念如、马杰、沈扬、周文元，即今之傫然在墓者也。</p>" +
    "<p>然五人之当刑也，意气扬扬，呼中丞之名而詈之，谈笑以死。断头置城上，颜色不少变。有贤士大夫发五十金，买五人之头而函之，卒与尸合。故今之墓中全乎为五人也。</p>" +
    "<p>嗟乎！大阉之乱，缙绅而能不易其志者，四海之大，有几人欤？而五人生于编伍之间，素不闻诗书之训，激昂大义，蹈死不顾，亦曷故哉？且矫诏纷出，钩党之捕遍于天下，卒以吾郡之发愤一击，不敢复有株治；大阉亦逡巡畏义，非常之谋难于猝发，待圣人之出而投缳道路，不可谓非五人之力也。</p>" +
    "<p> 由是观之，则今之高爵显位，一旦抵罪，或脱身以逃，不能容于远近，而又有剪发杜门，佯狂不知所之者，其辱人贱行，视五人之死，轻重固何如哉？是以蓼洲周公忠义暴于朝廷，赠谥褒美，显荣于身后；而五人亦得以加其土封，列其姓名于大堤之上，凡四方之士无不有过而拜且泣者，斯固百世之遇也。不然，令五人者保其首领，以老于户牖之下，则尽其天年，人皆得以隶使之，安能屈豪杰之流，扼腕墓道，发其志士之悲哉？故余与同社诸君子，哀斯墓之徒有其石也，而为之记，亦以明死生之大，匹夫之有重于社稷也。</p>" +
    "<p>贤士大夫者，冏卿因之吴公，太史文起文公、孟长姚公也。</p>"

const words12 = [
    {
        name: '郡',
        mean: '指吴郡，即今苏州市。',
        regex: '(?<=，)郡(?=之)'
    },
    {
        name: '当道',
        mean: '执掌政权的人。',
        regex: '(?<=于)当道(?=，)'
    },
    {
        name: '除魏阉废祠之址',
        mean: '谓清除魏忠贤生祠的旧址。除，修治，修整。魏阉，对魏忠贤的贬称。魏忠贤专权时，其党羽在各地为他建立生祠，事败后，这些祠堂均被废弃。',
        regex: '(?<=即)除魏阉废祠之址(?=以)'
    },
    {
        name: '旌',
        mean: '表扬，赞扬。',
        regex: '(?<=以)旌(?=其)'
    },
    {
        name: '去',
        mean: '距离。',
        regex: '(?<=，)去(?=今)'
    },
    {
        name: '墓',
        mean: '用作动词，即修墓。',
        regex: '(?<=之)墓(?=而)'
    },
    {
        name: '皦皦',
        mean: '同皎皎，光洁，明亮。这里指显赫。',
        regex: '(?<=之)皦皦(?=，)'
    },
    {
        name: '吾社',
        mean: '指应社。',
        regex: '(?<=。)吾社(?=之)'
    },
    {
        name: '行为士先者',
        mean: '行为能够成为士人表率的人。',
        regex: '(?<=之)行为士先者(?=，)'
    },
    {
        name: '声义',
        mean: '伸张正义。',
        regex: '(?<=之)声义(?=，)'
    },
    {
        name: '缇骑',
        mean: '穿桔红色衣服的朝廷护卫马队。明清逮治犯人也用缇骑，故后世用以称呼捕役。',
        regex: '(?<=。)缇骑(?=按)'
    },
    {
        name: '堪',
        mean: '忍受。',
        regex: '(?<=能)堪(?=，)'
    },
    {
        name: '抶而仆之',
        mean: '谓将其打倒在地。抶，击。仆，使仆倒。',
        regex: '(?<=，)抶而仆之(?=。)'
    },
    {
        name: '抚吴',
        mean: '做吴地的巡抚。',
        regex: '(?<=丞)抚吴(?=者)'
    },
    {
        name: '魏之私人',
        mean: '魏忠贤的党徒。',
        regex: '(?<=为)魏之私人(?=毛)'
    },
    {
        name: '其',
        mean: '指毛一鹭。',
        regex: '(?<=乘)其(?=厉)'
    },
    {
        name: '呵',
        mean: '呵斥、责骂。',
        regex: '(?<=以)呵(?=，)'
    },
    {
        name: '噪而相逐',
        mean: '大声吵嚷着追逐。',
        regex: '(?<=则)噪而相逐(?=。)'
    },
    {
        name: '匿于溷藩',
        mean: '藏在厕所。溷，厕所。藩，篱、墙。',
        regex: '(?<=丞)匿于溷藩(?=以)'
    },
    {
        name: '按诛',
        mean: '追究案情判定死罪。按，审查。',
        regex: '(?<=，)按诛(?=五)'
    },
    {
        name: '傫然',
        mean: '聚集的样子。',
        regex: '(?<=之)傫然(?=在)'
    },
    {
        name: '詈',
        mean: '骂。',
        regex: '(?<=而)詈(?=之)'
    },
    {
        name: '函之',
        mean: '用棺材收殓他们。',
        regex: '(?<=而)函之(?=，)'
    },
    {
        name: '大阉',
        mean: '指魏忠贤。',
        regex: '(?<=！)大阉(?=之)'
    },
    {
        name: '缙绅',
        mean: '也作搢绅，指古代缙笏（将笏插于腰带）、垂绅（垂着衣带）的人，即士大夫。缙，同搢，插。绅，大带。',
        regex: '(?<=，)缙绅(?=而)'
    },
    {
        name: '编伍',
        mean: '指平民。',
        regex: '(?<=于)编伍(?=之)'
    },
    {
        name: '曷',
        mean: '同何。',
        regex: '(?<=亦)曷(?=故)'
    },
    {
        name: '矫诏',
        mean: '假托君命颁发的诏令。',
        regex: '(?<=且)矫诏(?=纷)'
    },
    {
        name: '钩党之捕',
        mean: '这里指搜捕东林党人。钩党，被指为有牵连的同党。株治，株连惩治。',
        regex: '(?<=，)钩党之捕(?=遍)'
    },
    {
        name: '逡巡',
        mean: '欲进不进、迟疑不决的样子。',
        regex: '(?<=亦)逡巡(?=畏)'
    },
    {
        name: '非常之谋',
        mean: '指篡夺帝位的阴谋。',
        regex: '(?<=，)非常之谋(?=难)'
    },
    {
        name: '猝发',
        mean: '突然发动。',
        regex: '(?<=于)猝发(?=，)'
    },
    {
        name: '圣人',
        mean: '指崇祯皇帝朱由检。',
        regex: '(?<=待)圣人(?=之)'
    },
    {
        name: '投缳',
        mean: '自缢。',
        regex: '(?<=而)投缳(?=道)'
    },
    {
        name: '抵罪',
        mean: '因犯罪而受相应的惩罚。',
        regex: '(?<=旦)抵罪(?=，)'
    },
    {
        name: '辱人贱行',
        mean: '可耻的人格，卑贱的行为。',
        regex: '(?<=其)辱人贱行(?=，)'
    },
    {
        name: '暴',
        mean: '显露。',
        regex: '(?<=义)暴(?=于)'
    },
    {
        name: '赠谥美显',
        mean: '指崇祯追赠周顺昌忠介的谥号。',
        regex: '(?<=，)赠谥褒美(?=，)'
    },
    {
        name: '加其土封',
        mean: '增修他们的坟墓。',
        regex: '(?<=以)加其土封(?=，)'
    },
    {
        name: '百世之遇',
        mean: '百代的幸遇。',
        regex: '(?<=固)百世之遇(?=也)'
    },
    {
        name: '户牖',
        mean: '指家里。户，门。牖，窗。',
        regex: '(?<=于)户牖(?=之)'
    },
    {
        name: '隶使之',
        mean: '当作仆隶一样差使他们。隶，名词用作状语，像对待奴仆那样。',
        regex: '(?<=以)隶使之(?=，)'
    },
    {
        name: '屈',
        mean: '使屈身，倾倒。',
        regex: '(?<=能)屈(?=豪)'
    },
    {
        name: '扼腕墓道',
        mean: '用手握腕，表示情绪激动、振奋或惋惜。',
        regex: '(?<=，)扼腕墓道(?=，)'
    },
    {
        name: '明死生之大',
        mean: '表明死生的重大意义。',
        regex: '(?<=以)明死生之大(?=，)'
    },
    {
        name: '匹夫',
        mean: '指平民，这里指五义士。',
        regex: '(?<=，)匹夫(?=之)'
    },
    {
        name: '社稷',
        mean: '国家。',
        regex: '(?<=于)社稷(?=也)'
    },
]

const content13 =
    "<h1>陈情表</h1>" +
    "<h3>【作者】李密 【朝代】魏晋</h3>" +
    "<p>臣密言：臣以险衅，夙遭闵凶。生孩六月，慈父见背；行年四岁，舅夺母志。祖母刘愍臣孤弱，躬亲抚养。臣少多疾病，九岁不行，零丁孤苦，至于成立。既无伯叔，终鲜兄弟，门衰祚薄，晚有儿息。外无期功强近之亲，内无应门五尺之僮，茕茕孑立，形影相吊。而刘夙婴疾病，常在床蓐，臣侍汤药，未曾废离。</p>" +
    "<p>逮奉圣朝，沐浴清化。前太守臣逵察臣孝廉，后刺史臣荣举臣秀才。臣以供养无主，辞不赴命。诏书特下，拜臣郎中，寻蒙国恩，除臣洗马。猥以微贱，当侍东宫，非臣陨首所能上报。臣具以表闻，辞不就职。诏书切峻，责臣逋慢。郡县逼迫，催臣上道；州司临门，急于星火。臣欲奉诏奔驰，则刘病日笃；欲苟顺私情，则告诉不许：臣之进退，实为狼狈。伏惟圣朝以孝治天下，凡在故老，犹蒙矜育，况臣孤苦，特为尤甚。且臣少仕伪朝，历职郎署，本图宦达，不矜名节。今臣亡国贱俘，至微至陋，过蒙拔擢，宠命优渥，岂敢盘桓，有所希冀。但以刘日薄西山，气息奄奄，人命危浅，朝不虑夕。臣无祖母，无以至今日；祖母无臣，无以终余年。母、孙二人，更相为命，是以区区不能废远。</p>" +
    "<p>臣密今年四十有四，祖母今年九十有六，是臣尽节于陛下之日长，报养刘之日短也。乌鸟私情，愿乞终养。臣之辛苦，非独蜀之人士及二州牧伯所见明知，皇天后土实所共鉴。愿陛下矜悯愚诚，听臣微志，庶刘侥幸，保卒余年。臣生当陨首，死当结草。臣不胜犬马怖惧之情，谨拜表以闻。</p>"

const words13 = [
    {
        name: '险衅',
        mean: '灾难祸患，指命运坎坷。',
        regex: '(?<=以)险衅(?=，)'
    },
    {
        name: '夙',
        mean: '早，这里指幼年时。',
        regex: '(?<=，)夙(?=遭)'
    },
    {
        name: '见背',
        mean: '弃我而死去。',
        regex: '(?<=父)见背(?=；)'
    },
    {
        name: '成立',
        mean: '长大成人。',
        regex: '(?<=于)成立(?=。)'
    },
    {
        name: '祚',
        mean: '福分。',
        regex: '(?<=衰)祚(?=薄)'
    },
    {
        name: '茕茕孑立',
        mean: '生活孤单无靠。茕茕，孤单的样子。孑，孤单。',
        regex: '(?<=，)茕茕孑立(?=，)'
    },
    {
        name: '吊',
        mean: '安慰。',
        regex: '(?<=相)吊(?=。)'
    },
    {
        name: '婴',
        mean: '纠缠。',
        regex: '(?<=夙)婴(?=疾)'
    },
    {
        name: '废离',
        mean: '废养而远离。',
        regex: '(?<=曾)废离(?=。)'
    },
    {
        name: '察',
        mean: '考察，这里是推举的意思。',
        regex: '(?<=逵)察(?=臣)'
    },
    {
        name: '拜',
        mean: '授官。',
        regex: '(?<=，)拜(?=臣)'
    },
    {
        name: '寻',
        mean: '不久。',
        regex: '(?<=，)寻(?=蒙)'
    },
    {
        name: '除',
        mean: '任命官职。',
        regex: '(?<=，)除(?=臣)'
    },
    {
        name: '猥',
        mean: '辱，自谦之词。',
        regex: '(?<=。)猥(?=以)'
    },
    {
        name: '陨首',
        mean: '丧命。',
        regex: '(?<=臣)陨首(?=所)'
    },
    {
        name: '日笃',
        mean: '日益沉重。',
        regex: '(?<=病)日笃(?=；)'
    },
    {
        name: '苟顺',
        mean: '姑且迁就。',
        regex: '(?<=欲)苟顺(?=私)'
    },
    {
        name: '伏惟',
        mean: '旧时奏疏、书信中下级对上级常用的敬语。',
        regex: '(?<=。)伏惟(?=圣)'
    },
    {
        name: '故老',
        mean: '遗老。',
        regex: '(?<=在)故老(?=，)'
    },
    {
        name: '矜育',
        mean: '怜惜抚育。',
        regex: '(?<=蒙)矜育(?=，)'
    },
    {
        name: '矜',
        mean: '矜持爱惜。',
        regex: '(?<=不)矜(?=名)'
    },
    {
        name: '乌鸟私情',
        mean: '相传乌鸦能反哺，所以常用来比喻子女对父母的孝养之情。',
        regex: '(?<=。)乌鸟私情(?=，)'
    },
    {
        name: '愚诚',
        mean: '愚拙的至诚之心。',
        regex: '(?<=悯)愚诚(?=，)'
    },
    {
        name: '结草',
        mean: '据《左传•宣公十五年》记载，晋国大夫魏武子临死的时候，嘱咐他的儿子魏颗，把他的遗妾杀死以后殉葬。魏颗没有照他父亲说的话做。后来魏颗跟秦国的杜回作战，看见一个老人把草打了结把杜回绊倒，杜回因此被擒。到了晚上，魏颗梦见结草的老人，他自称是没有被杀死的魏武子遗妾的父亲。后来就把“结草”用来作为报答恩人心愿的表示。',
        regex: '(?<=当)结草(?=。)'
    },
    {
        name: '犬马',
        mean: '作者自比，表示谦卑。',
        regex: '(?<=胜)犬马(?=怖)'
    },
]

const content14 =
    "<h1>赤壁赋</h1>" +
    "<h3>【作者】苏轼 【朝代】宋</h3>" +
    "<p>壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。</p>" +
    "<p>于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉，余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。</p>" +
    "<p>苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“月明星稀，乌鹊南飞，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”</p>" +
    "<p>苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎!且夫天地之间，物各有主,苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭，是造物者之无尽藏也，而吾与子之所共适。”</p>" +
    "<p>客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。</p>"

const words14 = [
    {
        name: '既望',
        mean: '农历每月十六。农历每月十五日为“望日”，十六日为“既望”。',
        regex: '(?<=月)既望(?=，)'
    },
    {
        name: '徐',
        mean: '缓缓地。',
        regex: '(?<=风)徐(?=来)'
    },
    {
        name: '兴',
        mean: '起。',
        regex: '(?<=不)兴(?=。)'
    },
    {
        name: '属',
        mean: '倾注，引申为劝酒。',
        regex: '(?<=酒)属(?=客)'
    },
    {
        name: '少焉',
        mean: '一会儿。',
        regex: '(?<=。)少焉(?=，)'
    },
    {
        name: '纵一苇之所如，凌万顷之茫然',
        mean: '任凭小船在宽广的江面上飘荡。纵，任凭。一苇，比喻极小的船。如，往。凌，越过。万顷，极为宽阔的江面。茫然，旷远的样子。',
        regex: '(?<=。)纵一苇之所如，凌万顷之茫然(?=。)'
    },
    {
        name: '冯虚御风',
        mean: '乘风腾空而遨游。冯虚，凭空，凌空。冯，通“凭”，乘。御，驾御。',
        regex: '(?<=如)冯虚御风(?=，)'
    },
    {
        name: '羽化',
        mean: '传说成仙的人能像长了翅膀一样飞升。',
        regex: '(?<=，)羽化(?=而)'
    },
    {
        name: '扣舷',
        mean: '敲打着船边，指打节拍。',
        regex: '(?<=，)扣舷(?=而)'
    },
    {
        name: '桂棹兰桨',
        mean: '桂树做的棹，兰木做的桨。',
        regex: '(?<=“)桂棹兮兰桨(?=，)'
    },
    {
        name: '空明',
        mean: '月亮倒映水中的澄明之色。',
        regex: '(?<=击)空明(?=兮)'
    },
    {
        name: '溯',
        mean: '逆流而上。',
        regex: '(?<=兮)溯(?=流)'
    },
    {
        name: '美人',
        mean: '比喻心中美好的理想或好的君王。',
        regex: '(?<=望)美人(?=兮)'
    },
    {
        name: '倚歌',
        mean: '按照歌曲的声调节拍。',
        regex: '(?<=，)倚歌(?=而)'
    },
    {
        name: '和',
        mean: '同声相应，唱和。',
        regex: '(?<=而)和(?=之)'
    },
    {
        name: '袅袅',
        mean: '形容声音婉转悠长。',
        regex: '(?<=音)袅袅(?=，)'
    },
    {
        name: '幽壑',
        mean: '深谷，这里指深渊，此句意谓潜藏在深渊里的蛟龙为之起舞。',
        regex: '(?<=舞)幽壑(?=之)'
    },
    {
        name: '嫠妇',
        mean: '寡妇。白居易《琵琶行》写孤居的商人妻云',
        regex: '(?<=之)嫠妇(?=。)'
    },
    {
        name: '愀然',
        mean: '容色改变的样子。',
        regex: '(?<=子)愀然(?=，)'
    },
    {
        name: '正襟危坐',
        mean: '整理衣襟，（严肃地）端坐着。',
        regex: '(?<=，)正襟危坐(?=而)'
    },
    {
        name: '舳舻',
        mean: '战船前后相接，这里指战船。',
        regex: '(?<=，)舳舻(?=千)'
    },
    {
        name: '酾酒',
        mean: '滤酒，这里指斟酒。',
        regex: '(?<=，)酾酒(?=临)'
    },
    {
        name: '横槊',
        mean: '横执长矛。槊，长矛。',
        regex: '(?<=，)横槊(?=赋)'
    },
    {
        name: '侣',
        mean: '以……为伴侣，这里为意动用法。',
        regex: '(?<=，)侣(?=鱼)'
    },
    {
        name: '匏尊',
        mean: '用葫芦做成的酒器。匏，葫芦。尊，同“樽”。',
        regex: '(?<=举)匏樽(?=以)'
    },
    {
        name: '寄',
        mean: '寓托。',
        regex: '(?<=。)寄(?=蜉)'
    },
    {
        name: '须臾',
        mean: '片刻，形容生命之短。',
        regex: '(?<=之)须臾(?=，)'
    },
    {
        name: '长终',
        mean: '至于永远。',
        regex: '(?<=而)长终(?=。)'
    },
    {
        name: '骤',
        mean: '一下子，很轻易地。',
        regex: '(?<=乎)骤(?=得)'
    },
    {
        name: '遗响',
        mean: '余音，指箫声。',
        regex: '(?<=托)遗响(?=于)'
    },
    {
        name: '逝者如斯',
        mean: '流逝的像这江水。语出《论语·子罕》',
        regex: '(?<=？)逝者如斯(?=，)'
    },
    {
        name: '卒',
        mean: '最终。',
        regex: '(?<=而)卒(?=莫)'
    },
    {
        name: '消长',
        mean: '增减。',
        regex: '(?<=莫)消长(?=也)'
    },
    {
        name: '曾不能',
        mean: '固定词组，连……都不够。曾，连……都。',
        regex: '(?<=地)曾不能(?=以)'
    },
    {
        name: '适',
        mean: '享用。',
        regex: '(?<=共)适(?=。)'
    },
    {
        name: '枕藉',
        mean: '相互靠着。',
        regex: '(?<=与)枕藉(?=乎)'
    },
]

const content15 =
    "<h1>逍遥游</h1>" +
    "<h3>【作者】庄周 【朝代】先秦</h3>" +
    "<p>北冥有鱼，其名为鲲。鲲之大，不知其几千里也；化而为鸟，其名为鹏。鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。《齐谐》者，志怪者也。《谐》之言曰：“鹏之徙于南冥也，水击三千里，抟扶摇而上者九万里，去以六月息者也。”野马也，尘埃也，生物之以息相吹也。天之苍苍，其正色邪？其远而无所至极邪？其视下也，亦若是则已矣。且夫水之积也不厚，则其负大舟也无力。覆杯水于坳堂之上，则芥为之舟，置杯焉则胶，水浅而舟大也。风之积也不厚，则其负大翼也无力。故九万里，则风斯在下矣，而后乃今培风；背负青天，而莫之夭阏者，而后乃今将图南。蜩与学鸠笑之曰：“我决起而飞，抢榆枋而止，时则不至，而控于地而已矣，奚以之九万里而南为？”适莽苍者，三餐而反，腹犹果然；适百里者，宿舂粮；适千里者，三月聚粮。之二虫又何知！</p>" +
    "<p>小知不及大知，小年不及大年。奚以知其然也？朝菌不知晦朔，蟪蛄不知春秋，此小年也。楚之南有冥灵者，以五百岁为春，五百岁为秋；上古有大椿者，以八千岁为春，八千岁为秋，此大年也。而彭祖乃今以久特闻，众人匹之，不亦悲乎！汤之问棘也是已。穷发之北，有冥海者，天池也。有鱼焉，其广数千里，未有知其修者，其名为鲲。有鸟焉，其名为鹏，背若泰山，翼若垂天之云，抟扶摇羊角而上者九万里，绝云气，负青天，然后图南，且适南冥也。斥鴳笑之曰：“彼且奚适也？我腾跃而上，不过数仞而下，翱翔蓬蒿之间，此亦飞之至也。而彼且奚适也？”此小大之辩也。</p>" +
    "<p>故夫知效一官，行比一乡，德合一君，而征一国者，其自视也，亦若此矣。而宋荣子犹然笑之。且举世誉之而不加劝，举世非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。彼其于世，未数数然也。虽然，犹有未树也。夫列子御风而行，泠然善也，旬有五日而后反。彼于致福者，未数数然也。此虽免乎行，犹有所待者也。若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉？故曰：至人无己，神人无功，圣人无名。</p>"

const words15 = [
    {
        name: '冥',
        mean: '通假“溟”，指海色深黑。“北冥”，北海。下文“南冥”，指南海。传说北海无边无际，水深而黑。',
        regex: '(?<=北)冥(?=有)'
    },
    {
        name: '鲲',
        mean: '传说中的大鱼。',
        regex: '(?<=为)鲲(?=。)'
    },
    {
        name: '怒',
        mean: '奋起的样子，这里指鼓起翅膀。',
        regex: '(?<=；)怒(?=而)'
    },
    {
        name: '垂',
        mean: '同“陲”，边际。',
        regex: '(?<=若)垂(?=天)'
    },
    {
        name: '徙',
        mean: '迁移。',
        regex: '(?<=将)徙(?=于)'
    },
    {
        name: '天池',
        mean: '天然形成的大海。',
        regex: '(?<=，)天池(?=也)'
    },
    {
        name: '志怪',
        mean: '记载怪异的事物。志，记载。',
        regex: '(?<=，)志怪(?=者)'
    },
    {
        name: '水击',
        mean: '指鹏鸟的翅膀拍击水面。击，拍打。',
        regex: '(?<=，)水击(?=三)'
    },
    {
        name: '抟',
        mean: '回旋而上。一作“搏”，拍。',
        regex: '(?<=，)抟(?=扶)'
    },
    {
        name: '去',
        mean: '离，这里指离开北海。',
        regex: '(?<=，)去(?=以)'
    },
    {
        name: '息',
        mean: '风。',
        regex: '(?<=月)息(?=者)'
    },
    {
        name: '野马',
        mean: '指游动的雾气。古人认为，春天万物生机萌发，大地之上游气奔涌如野马一般。',
        regex: '(?<=”)野马(?=也)'
    },
    {
        name: '尘埃',
        mean: '扬在空中的土叫“尘”，细碎的尘粒叫“埃”。',
        regex: '(?<=，)尘埃(?=也)'
    },
    {
        name: '息',
        mean: '这里指有生命的东西呼吸所产生的气息。',
        regex: '(?<=以)息(?=相)'
    },
    {
        name: '苍苍',
        mean: '深蓝。',
        regex: '(?<=之)苍苍(?=，)'
    },
    {
        name: '其正色邪',
        mean: '或许是上天真正的颜色？其，抑，或许。正色，真正的颜色。邪，同“耶”，疑问语气词。',
        regex: '(?<=，)其正色邪(?=？)'
    },
    {
        name: '极',
        mean: '尽。',
        regex: '(?<=至)极(?=邪)'
    },
    {
        name: '下',
        mean: '向下。',
        regex: '(?<=视)下(?=也)'
    },
    {
        name: '已',
        mean: '罢了。',
        regex: '(?<=则)已(?=矣)'
    },
    {
        name: '覆',
        mean: '倾倒。',
        regex: '(?<=。)覆(?=杯)'
    },
    {
        name: '坳堂',
        mean: '指堂中低凹处。坳，凹陷不平。',
        regex: '(?<=于)坳堂(?=之)'
    },
    {
        name: '芥',
        mean: '小草。',
        regex: '(?<=则)芥(?=为)'
    },
    {
        name: '置杯焉则胶',
        mean: '将杯子放于其中则胶着搁浅。置，放。焉，于此。胶，指着地。',
        regex: '(?<=，)置杯焉则胶(?=，)'
    },
    {
        name: '培',
        mean: '凭。',
        regex: '(?<=今)培(?=风)'
    },
    {
        name: '图南',
        mean: '计划向南飞。',
        regex: '(?<=将)图南(?=。)'
    },
    {
        name: '决',
        mean: '疾速的样子。',
        regex: '(?<=我)决(?=起)'
    },
    {
        name: '抢',
        mean: '触，碰，着落。“抢”也作“枪”。',
        regex: '(?<=，)抢(?=榆)'
    },
    {
        name: '控',
        mean: '投，落下。',
        regex: '(?<=而)控(?=于)'
    },
    {
        name: '南',
        mean: '名词作动词，向南（飞行）。',
        regex: '(?<=而)南(?=为)'
    },
    {
        name: '适',
        mean: '去，往。',
        regex: '(?<=”)适(?=莽)'
    },
    {
        name: '犹',
        mean: '还。',
        regex: '(?<=腹)犹(?=果)'
    },
    {
        name: '以',
        mean: '凭。',
        regex: '(?<=今)以(?=久)'
    },
    {
        name: '特',
        mean: '独。',
        regex: '(?<=久)特(?=闻)'
    },
    {
        name: '匹',
        mean: '配，比。',
        regex: '(?<=人)匹(?=之)'
    },
    {
        name: '穷发',
        mean: '传说中极荒远的不生草木之地。发，指草木植被。',
        regex: '(?<=。)穷发(?=之)'
    },
    {
        name: '修',
        mean: '长。',
        regex: '(?<=其)修(?=者)'
    },
    {
        name: '绝',
        mean: '穿过。',
        regex: '(?<=，)绝(?=云)'
    },
    {
        name: '至',
        mean: '极点。',
        regex: '(?<=之)至(?=也)'
    },
    {
        name: '小大之辩',
        mean: '小和大的区别。辩，同“辨”，分辨，分别。',
        regex: '(?<=此)小大之辩(?=也)'
    },
    {
        name: '效',
        mean: '效力，尽力。',
        regex: '(?<=知)效(?=一)'
    },
    {
        name: '比',
        mean: '合。',
        regex: '(?<=行)比(?=一)'
    },
    {
        name: '合',
        mean: '使……满意。',
        regex: '(?<=德)合(?=一)'
    },
    {
        name: '征',
        mean: '征服。',
        regex: '(?<=而)征(?=一)'
    },
    {
        name: '举',
        mean: '全。',
        regex: '(?<=且)举(?=世)'
    },
    {
        name: '劝',
        mean: '勉励。',
        regex: '(?<=加)劝(?=，)'
    },
    {
        name: '非',
        mean: '责难，批评。',
        regex: '(?<=世)非(?=之)'
    },
    {
        name: '沮',
        mean: '沮丧。',
        regex: '(?<=加)沮(?=，)'
    },
    {
        name: '定',
        mean: '认清。',
        regex: '(?<=，)定(?=乎)'
    },
    {
        name: '内外',
        mean: '这里分别指自身和身外之物。在庄子看来，自主的精神是内在的，荣誉和非难都是外在的，而只有自主的精神才是重要的、可贵的。',
        regex: '(?<=乎)内外(?=之)'
    },
    {
        name: '数数然',
        mean: '汲汲然，指急迫用世、谋求名利、拼命追求的样子。',
        regex: '(?<=未)数数然(?=也)'
    },
    {
        name: '泠然',
        mean: '轻妙飘然的样子。',
        regex: '(?<=，)泠然(?=善)'
    },
    {
        name: '致福',
        mean: '求福。',
        regex: '(?<=于)致福(?=者)'
    },
    {
        name: '待',
        mean: '凭借，依靠。',
        regex: '(?<=所)待(?=者)'
    },
    {
        name: '御六气之辩',
        mean: '驾驭六气的变化。御，驾驭、把握。六气',
        regex: '(?<=而)御六气之辩(?=，)'
    },
    {
        name: '且恶',
        mean: '且，将要。恶，何，什么。',
        regex: '(?<=彼)且恶(?=乎)'
    },
    {
        name: '至人',
        mean: '庄子认为修养最高的人。下文“神人”“圣人”义相近。',
        regex: '(?<=：)至人(?=无)'
    },
]

const content16 =
    "<h1>滕王阁序</h1>" +
    "<h3>【作者】王勃 【朝代】唐</h3>" +
    "<p>豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟;人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临;宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区;童子何知，躬逢胜饯。</p>" +
    "<p>时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄;飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人;萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年?</p>" +
    "<p>嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主;窜梁鸿于海曲，岂乏明时?所赖君子见机，达人知命。老当益壮，宁移白首之心;穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情;阮籍猖狂，岂效穷途之哭!勃，三尺微命，一介书生。无路请缨，等终军之弱冠;有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜;钟期既遇，奏流水以何惭?呜呼!胜地不常，盛筵难再;兰亭已矣，梓 泽丘墟。临别赠言，幸承恩于伟饯;登高作赋，是所望于群公。敢竭鄙怀，恭疏短引;一言均赋，四韵俱成。请洒潘江，各倾陆海云尔。</p>" +
    "<p>滕王高阁临江渚，佩玉鸣鸾罢歌舞。</p>" +
    "<p>画栋朝飞南浦云，珠帘暮卷西山雨。</p>" +
    "<p>闲云潭影日悠悠，物换星移几度秋。</p>" +
    "<p>阁中帝子今何在？槛外长江空自流。</p>"

const words16 = [
    {
        name: '襟',
        mean: '以……为襟。因豫章在三江上游，如衣之襟，故称。',
        regex: '(?<=。)襟(?=三)'
    },
    {
        name: '带',
        mean: '以……为带。五湖在豫章周围，如衣束身，故称。',
        regex: '(?<=而)带(?=五)'
    },
    {
        name: '引',
        mean: '连接。',
        regex: '(?<=而)引(?=瓯)'
    },
    {
        name: '物华天宝',
        mean: '地上的宝物焕发为天上的宝气。',
        regex: '(?<=。)物华天宝(?=，)'
    },
    {
        name: '杰',
        mean: '俊杰，豪杰。',
        regex: '(?<=人)杰(?=地)'
    },
    {
        name: '雾列',
        mean: '雾，像雾一样，名词作状语。喻浓密、繁盛，雾列形容繁华。“星”的用法同“雾”。',
        regex: '(?<=州)雾列(?=，)'
    },
    {
        name: '枕',
        mean: '占据，地处。',
        regex: '(?<=隍)枕(?=夷)'
    },
    {
        name: '尽',
        mean: '都是。',
        regex: '(?<=主)尽(?=东)'
    },
    {
        name: '雅望',
        mean: '崇高声望。',
        regex: '(?<=之)雅望(?=，)'
    },
    {
        name: '懿范',
        mean: '好榜样。',
        regex: '(?<=之)懿范(?=，)'
    },
    {
        name: '襜帷',
        mean: '车上的帷幕，这里代指车马。',
        regex: '(?<=，)襜帷(?=暂)'
    },
    {
        name: '潦水',
        mean: '雨后的积水。',
        regex: '(?<=。)潦水(?=尽)'
    },
    {
        name: '骖騑',
        mean: '驾车的马匹。',
        regex: '(?<=俨)骖騑(?=于)'
    },
    {
        name: '上路',
        mean: '高高的道路。',
        regex: '(?<=于)上路(?=，)'
    },
    {
        name: '崇阿',
        mean: '高大的山陵。',
        regex: '(?<=于)崇阿(?=；)'
    },
    {
        name: '层',
        mean: '重叠。',
        regex: '(?<=。)层(?=峦)'
    },
    {
        name: '上',
        mean: '上达。',
        regex: '(?<=，)上(?=出)'
    },
    {
        name: '飞阁',
        mean: '架空建筑的阁道',
        regex: '(?<=;)飞阁(?=流)'
    },
    {
        name: '丹',
        mean: '丹漆，泛指彩绘',
        regex: '(?<=流)丹(?=，)'
    },
    {
        name: '临',
        mean: '从高处往下探望。',
        regex: '(?<=下)临(?=无)'
    },
    {
        name: '汀',
        mean: '水边平地',
        regex: '(?<=鹤)汀(?=凫)'
    },
    {
        name: '渚',
        mean: '水中小洲',
        regex: '(?<=凫)渚(?=，)'
    },
    {
        name: '绣闼',
        mean: '绘饰华美的门。',
        regex: '(?<=披)绣闼(?=，)'
    },
    {
        name: '雕甍',
        mean: '雕饰华美的屋脊。',
        regex: '(?<=俯)雕甍(?=，)'
    },
    {
        name: '盈视',
        mean: '极目远望，满眼都是。',
        regex: '(?<=其)盈视(?=，)'
    },
    {
        name: '骇瞩',
        mean: '对所见的景物感到惊骇。',
        regex: '(?<=其)骇瞩(?=。)'
    },
    {
        name: '闾阎',
        mean: '里门，这里代指房屋。',
        regex: '(?<=。)闾阎(?=扑)'
    },
    {
        name: '弥',
        mean: '满。',
        regex: '(?<=舰)弥(?=津)'
    },
    {
        name: '青雀黄龙',
        mean: '船的装饰形状，船头作鸟头型，龙头型。',
        regex: '(?<=，)青雀黄龙(?=之)'
    },
    {
        name: '销',
        mean: '“销”通“消”，消散。',
        regex: '(?<=云)销(?=雨)'
    },
    {
        name: '霁',
        mean: '雨过天晴',
        regex: '(?<=雨)霁(?=，)'
    },
    {
        name: '彩',
        mean: '日光。',
        regex: '(?<=，)彩(?=彻)'
    },
    {
        name: '区',
        mean: '天空。',
        regex: '(?<=彻)区(?=明)'
    },
    {
        name: '穷',
        mean: '穷尽，引申为“直到”。',
        regex: '(?<=响)穷(?=彭)'
    },
    {
        name: '浦',
        mean: '水边、岸边。',
        regex: '(?<=之)浦(?=。)'
    },
    {
        name: '遥',
        mean: '远望。',
        regex: '(?<=。)遥(?=襟)'
    },
    {
        name: '畅',
        mean: '顿时。',
        regex: '(?<=甫)畅(?=，)'
    },
    {
        name: '兴',
        mean: '兴致。',
        regex: '(?<=逸)兴(?=遄)'
    },
    {
        name: '爽籁',
        mean: '清脆的排箫音乐。',
        regex: '(?<=。)爽籁(?=发)'
    },
    {
        name: '睢园绿竹',
        mean: '睢园，即汉梁孝王菟园，梁孝王曾在园中聚集文人饮酒赋诗。《水经注》，“睢水又东南流，历于竹圃……世人言梁王竹园也。”',
        regex: '(?<=云)遏(?=。)'
    },
    {
        name: '凌',
        mean: '超过。',
        regex: '(?<=。)睢园绿竹(?=，)'
    },
    {
        name: '樽',
        mean: '酒器。陶渊明《归去来兮辞》有“有酒盈樽”之句。',
        regex: '(?<=气)凌(?=彭)'
    },
    {
        name: '朱华',
        mean: '荷花。曹植《公宴诗》，“秋兰被长坂，朱华冒绿池。”',
        regex: '(?<=之)樽(?=；)'
    },
    {
        name: '中天',
        mean: '长天。',
        regex: '(?<=水)朱华(?=，)'
    },
    {
        name: '迥',
        mean: '大',
        regex: '(?<=于)中天(?=，)'
    },
    {
        name: '宇宙',
        mean: '喻指天地。《淮南子·原道训》高诱注，“四方上下曰‘宇’，古往来今曰‘宙’。”',
        regex: '(?<=地)迥(?=，)'
    },
    {
        name: '盈虚',
        mean: '消长，指变化。',
        regex: '(?<=觉)宇宙(?=之)'
    },
    {
        name: '数',
        mean: '定数，命运。',
        regex: '(?<=识)盈虚(?=之)'
    },
    {
        name: '天柱',
        mean: '传说中昆仑山高耸入天的铜柱。《神异经》，“昆仑之山，有铜柱焉。其高入天，所谓天柱也。”',
        regex: '(?<=有)数(?=。)'
    },
    {
        name: '北辰',
        mean: '北极星，比喻国君。《论语·为政》，“为政以德，譬如北辰，居其所而众星共（拱）之。”',
        regex: '(?<=，)天柱(?=高)'
    },
    {
        name: '关山',
        mean: '险关和高山。',
        regex: '(?<=而)北辰(?=远)'
    },
    {
        name: '悲',
        mean: '同情,可怜',
        regex: '(?<=。)关山(?=难)'
    },
    {
        name: '失路',
        mean: '仕途不遇。',
        regex: '(?<=谁)悲(?=失)'
    },
    {
        name: '萍水相逢',
        mean: '浮萍随水漂泊，聚散不定。比喻向来不认识的人偶然相遇。',
        regex: '(?<=;)萍水相逢(?=，)'
    },
    {
        name: '命途',
        mean: '命运',
        regex: '(?<=！)时运不齐(?=，)'
    },
    {
        name: '时运不齐',
        mean: '命运不好。不齐，有蹉跎、有坎坷。',
        regex: '(?<=，)命途(?=多)'
    },
    {
        name: '坠',
        mean: '坠落，引申为“放弃”。',
        regex: '(?<=不)坠(?=青)'
    },
    {
        name: '簪笏',
        mean: '冠簪、手版。官吏用物，这里代指官职地位。',
        regex: '(?<=舍)簪笏(?=于)'
    },
    {
        name: '百龄',
        mean: '百年，犹“一生”。',
        regex: '(?<=于)百龄(?=，)'
    },
    {
        name: '捧袂',
        mean: '举起双袖，表示恭敬的姿势。',
        regex: '(?<=兹)捧袂(?=，)'
    },
    {
        name: '临别赠言',
        mean: '临别时赠送正言以互相勉励，在此指本文。',
        regex: '(?<=。)临别赠言(?=，)'
    },
    {
        name: '恭疏短引',
        mean: '恭敬地写下一篇小序，在此指本文。',
        regex: '(?<=，)恭疏短引(?=;)'
    },
    {
        name: '一言均赋',
        mean: '每人都写一首诗。',
        regex: '(?<=;)一言均赋(?=，)'
    },
]

const content17 =
    "<h1>齐桓晋文之事</h1>" +
    "<h3>【作者】孟子及弟子 【朝代】先秦</h3>" +
    "<p>齐宣王问曰：“齐桓、晋文之事，可得闻乎？”</p>" +
    "<p>孟子对曰：“仲尼之徒，无道桓、文之事者，是以后世无传焉，臣未之闻也。无以，则王乎？”</p>" +
    "<p>曰：“德何如则可以王矣？”</p>" +
    "<p>曰：“保民而王，莫之能御也。”</p>" +
    "<p>曰：“若寡人者，可以保民乎哉？”</p>" +
    "<p>曰：“可。”</p>" +
    "<p>曰：“何由知吾可也？”</p>" +
    "<p>曰：“臣闻之胡龁曰：‘王坐于堂上，有牵牛而过堂下者，王见之，曰：“牛何之？”对曰：“将以衅钟。”王曰：“舍之！吾不忍其觳觫，若无罪而就死地。”对曰：“然则废衅钟与？”曰：“何可废也，以羊易之。”’不识有诸？”</p>" +
    "<p>曰：“有之。”</p>" +
    "<p>曰：“是心足以王矣。百姓皆以王为爱也，臣固知王之不忍也。”</p>" +
    "<p>王曰：“然，诚有百姓者。齐国虽褊小，吾何爱一牛？即不忍其觳觫，若无罪而就死地，故以羊易之也。”</p>" +
    "<p>曰：“王无异于百姓之以王为爱也。以小易大，彼恶知之？王若隐其无罪而就死地，则牛羊何择焉？”</p>" +
    "<p>王笑曰：“是诚何心哉！我非爱其财而易之以羊也，宜乎百姓之谓我爱也。”</p>" +
    "<p>曰：“无伤也，是乃仁术也！见牛未见羊也。君子之于禽兽也：见其生，不忍见其死；闻其声，不忍食其肉。是以君子远庖厨也。”</p>" +
    "<p>王说曰：“《诗》云：‘他人有心，予忖度之。’夫子之谓也。夫我乃行之，反而求之，不得吾心；夫子言之，于我心有戚戚焉。此心之所以合于王者何也？”</p>" +
    "<p>曰：“有复于王者曰：‘吾力足以举百钧，而不足以举一羽；明足以察秋毫之末，而不见舆薪。’则王许之乎？”</p>" +
    "<p>曰：“否！”</p>" +
    "<p>“今恩足以及禽兽，而功不至于百姓者，独何与？然则一羽之不举，为不用力焉；舆薪之不见，为不用明焉；百姓之不见保，为不用恩焉。故王之不王，不为也，非不能也。”</p>" +
    "<p>曰：“不为者与不能者之形，何以异？”</p>" +
    "<p>曰：“挟太山以超北海，语人曰：‘我不能。’是诚不能也。为长者折枝，语人曰：‘我不能。’是不为也，非不能也。故王之不王，非挟太山以超北海之类也；王之不王，是折枝之类也。”</p>" +
    "<p>“老吾老，以及人之老；幼吾幼，以及人之幼；天下可运于掌。诗云：‘刑于寡妻，至于兄弟，以御于家邦。’言举斯心加诸彼而已。故推恩足以保四海，不推恩无以保妻子。古之人所以大过人者，无他焉，善推其所为而已矣！今恩足以及禽兽，而功不至于百姓者，独何与？权，然后知轻重；度，然后知长短。物皆然，心为甚。王请度之。抑王兴甲兵，危士臣，构怨于诸侯，然后快于心与？”</p>"

const words17 = [
    {
        name: '道',
        mean: '述说，谈论。儒家学派称道尧舜禹汤文武等先王之道，不主张霸道，所以孟子这样说。',
        regex: '(?<=无)道(?=桓)'
    },
    {
        name: '无以',
        mean: '不得已。以，同已，作止讲。',
        regex: '(?<=。)无以(?=，)'
    },
    {
        name: '王',
        mean: '用作动词，指王天下，即用王道（仁政）统一天下。',
        regex: '(?<=而)王(?=，)'
    },
    {
        name: '莫之能御',
        mean: '没有人能抵御他。御，抵御、阻挡。',
        regex: '(?<=，)莫之能御(?=也)'
    },
    {
        name: '就',
        mean: '接近，走向。',
        regex: '(?<=而)就(?=死)'
    },
    {
        name: '然则',
        mean: '既然如此，那么就。',
        regex: '(?<=“)然则(?=废)'
    },
    {
        name: '易',
        mean: '交换。',
        regex: '(?<=羊)易(?=之)'
    },
    {
        name: '识',
        mean: '知道。',
        regex: '(?<=不)识(?=有)'
    },
    {
        name: '是',
        mean: '代词，这种。',
        regex: '(?<=“)是(?=心)'
    },
    {
        name: '爱',
        mean: '爱惜，这里含有吝啬之意。',
        regex: '(?<=为)爱(?=也)'
    },
    {
        name: '诚',
        mean: '的确，确实。',
        regex: '(?<=，)诚(?=有)'
    },
    {
        name: '无异',
        mean: '莫怪，不要感到奇怪。',
        regex: '(?<=王)无异(?=于)'
    },
    {
        name: '彼恶知之',
        mean: '他们怎么知道呢？',
        regex: '(?<=，)彼恶知之(?=？)'
    },
    {
        name: '隐',
        mean: '哀怜。',
        regex: '(?<=若)隐(?=其)'
    },
    {
        name: '择',
        mean: '区别，分别。',
        regex: '(?<=何)择(?=焉)'
    },
    {
        name: '宜',
        mean: '应当。',
        regex: '(?<=，)宜(?=乎)'
    },
    {
        name: '无伤',
        mean: '没有什么妨碍，此处译为没有什么关系。',
        regex: '(?<=“)无伤(?=也)'
    },
    {
        name: '仁术',
        mean: '指仁爱之道，实施仁政的途径。',
        regex: '(?<=乃)仁术(?=也)'
    },
    {
        name: '忖度',
        mean: '揣测。',
        regex: '(?<=予)忖度(?=之)'
    },
    {
        name: '夫子之谓也',
        mean: '（这话）说的就是你这样的人。',
        regex: '(?<=’)夫子之谓也(?=。)'
    },
    {
        name: '戚戚',
        mean: '心动的样子，指有同感。',
        regex: '(?<=有)戚戚(?=焉)'
    },
    {
        name: '复',
        mean: '报告。',
        regex: '(?<=有)复(?=于)'
    },
    {
        name: '明',
        mean: '眼力。',
        regex: '(?<=；)明(?=足)'
    },
    {
        name: '秋毫之末',
        mean: '鸟兽秋天生出的绒毛的尖端，喻极细小的东西。',
        regex: '(?<=察)秋毫之末(?=，)'
    },
    {
        name: '王许之乎',
        mean: '大王相信吗？',
        regex: '(?<=则)王许之乎(?=？)'
    },
    {
        name: '见保',
        mean: '受到保护或安抚。',
        regex: '(?<=不)见保(?=，)'
    },
    {
        name: '形',
        mean: '具体的外在区别和表现。',
        regex: '(?<=之)形(?=，)'
    },
    {
        name: '超',
        mean: '跳过。',
        regex: '(?<=以)超(?=北)'
    },
    {
        name: '枝',
        mean: '枝同肢。一说指向老者折腰行鞠躬礼，一说替长者攀摘树枝，皆指轻而易举之事。',
        regex: '(?<=折)枝(?=，)'
    },
    {
        name: '运于掌',
        mean: '运转在手掌上，比喻称王天下很容易办到。',
        regex: '(?<=可)运于掌(?=。)'
    },
    {
        name: '御',
        mean: '治理。',
        regex: '(?<=以)御(?=于)'
    },
    {
        name: '权',
        mean: '秤锤，这里作动词用，指用秤称重。',
        regex: '(?<=？)权(?=，)'
    },
    {
        name: '抑',
        mean: '表示反问，相当于难道。',
        regex: '(?<=。)抑(?=王)'
    },
    {
        name: '危',
        mean: '使受到危害。',
        regex: '(?<=，)危(?=士)'
    },
]

const content18 =
    "<h1>庄暴见孟子</h1>" +
    "<h3>【作者】孟子及弟子 【朝代】先秦</h3>" +
    "<p>庄暴见孟子，曰：“暴见于王，王语暴以好乐，暴未有以对也。”曰：“好乐何如？”</p>" +
    "<p>孟子曰：“王之好乐甚，则齐国其庶几乎！”</p>" +
    "<p>他日，见于王曰：“王尝语庄子以好乐，有诸？”</p>" +
    "<p>王变乎色，曰：“寡人非能好先王之乐也，直好世俗之乐耳。”</p>" +
    "<p>曰：“王之好乐甚，则齐其庶几乎！今之乐犹古之乐也。”</p>" +
    "<p>曰：“可得闻与？”</p>" +
    "<p>曰：“独乐乐，与人乐乐，孰乐？”</p>" +
    "<p>曰：“不若与人。”</p>" +
    "<p>曰：“与少乐乐，与众乐乐，孰乐？”</p>" +
    "<p>曰：“不若与众。”</p>" +
    "<p>“臣请为王言乐。今王鼓乐于此，百姓闻王钟鼓之声、管籥之音，举疾首蹩頞而相告曰：‘吾王之好鼓乐，夫何使我至于此极也，父子不相见，兄弟妻子离散。’今王畋猎于此，百姓闻王车马之音，见羽旄之美，举疾首蹩頞而相告曰：‘吾王之好田猎，夫何使我至于此极也？父子不相见，兄弟妻子离散。’此无他，不与民同乐也。“</p>" +
    "<p>“今王鼓乐于此，百姓闻王钟鼓之声、管籥之音，举欣欣然有喜色而相告曰：‘吾王庶几无疾病与，何以能鼓乐也？’今王田猎于此，百姓闻王车马之音，见羽旄之美，举欣欣然有喜色而相告曰：‘吾王庶几无疾病与，何以能田猎也？’此无他，与民同乐也。今王与百姓同乐，则王矣！”</p>"

const words18 = [
    {
        name: '庄暴',
        mean: '人名，即下文提到的的庄子。',
        regex: '庄暴(?=见)'
    },
    {
        name: '见于王',
        mean: '被齐王召见或朝见齐王。',
        regex: '(?<=暴)见于王(?=，)'
    },
    {
        name: '乐',
        mean: '五声八音总名。',
        regex: '(?<=好)乐(?=，)'
    },
    {
        name: '庶几',
        mean: '差不多。',
        regex: '(?<=其)庶几(?=乎)'
    },
    {
        name: '变乎色',
        mean: '改变了脸色。色，脸色子。',
        regex: '(?<=王)变乎色(?=，)'
    },
    {
        name: '直',
        mean: '不过、仅仅。',
        regex: '(?<=，)直(?=好)'
    },
    {
        name: '独乐乐',
        mean: '独自一人欣赏音乐快乐。',
        regex: '(?<=“)独乐乐(?=，)'
    },
    {
        name: '管籥之音',
        mean: '这里泛指音乐。管，籥，两种管乐器，前者跟笛子相似，后者似是排箫的前身。',
        regex: '(?<=、)管籥之音(?=，)'
    },
    {
        name: '疾首蹙頞举',
        mean: '形容心里非常怨恨和讨厌。疾首，头痛。蹙頞，皱眉头。頞，鼻梁。皆、都。',
        regex: '(?<=，)举疾首蹩頞(?=而)'
    },
    {
        name: '田猎',
        mean: '在野外打猎。',
        regex: '(?<=王)田猎(?=于)'
    },
    {
        name: '羽旄',
        mean: '古代军旗的一种，用野鸡毛，牦牛尾装饰旗杆。旄，牦牛尾。',
        regex: '(?<=见)羽旄(?=之)'
    },
]

const content19 =
    "<h1>齐人有一妻一妾</h1>" +
    "<h3>【作者】孟子及弟子 【朝代】先秦</h3>" +
    "<p>齐人有一妻一妾而处室者，其良人出，则必餍酒肉而后反。 其妻问所与饮食者，则尽富贵也。其妻告其妾曰：“良人出，则必餍酒肉而后反；问其与饮食者，尽富贵也，而未尝有显者来，吾将瞷良人之所之也。”</p>" +
    "<p>蚤起，施从良人之所之，遍国中无与立谈者。卒之东郭墦间，之祭者，乞其余；不足，又顾而之他——此其为餍足之道也。 其妻归，告其妾，曰：“良人者，所仰望而终身也，今若此！－－”与其妾讪其良人，而相泣于中庭，而良人未之知也，施施从外来，骄其妻妾。</p>"

const words19 = [
    {
        name: '处室',
        mean: '居家度日。',
        regex: '(?<=而)处室(?=者)'
    },
    {
        name: '良人',
        mean: '古时妻子称丈夫。',
        regex: '(?<=其)良人(?=出)'
    },
    {
        name: '餍',
        mean: '饱食。',
        regex: '(?<=必)餍(?=酒)'
    },
    {
        name: '反',
        mean: '通返，回家。',
        regex: '(?<=后)反(?=。)'
    },
    {
        name: '显者',
        mean: '显要的人，达官贵人。',
        regex: '(?<=有)显者(?=来)'
    },
    {
        name: '瞷',
        mean: '窥视，偷看。',
        regex: '(?<=将)瞷(?=良)'
    },
    {
        name: '蚤',
        mean: '同早。',
        regex: '蚤(?=起)'
    },
    {
        name: '施',
        mean: '斜。这里指斜行，斜从跟随，以免被丈夫发现。',
        regex: '(?<=，)施(?=从)'
    },
    {
        name: '国中',
        mean: '都城中。国，城。',
        regex: '(?<=遍)国中(?=无)'
    },
    {
        name: '东郭墦间',
        mean: '东边城墙的坟墓间。郭，城墙。墦，坟墓',
        regex: '(?<=之)东郭墦间(?=，)'
    },
    {
        name: '讪',
        mean: '讥讽，嘲骂。',
        regex: '(?<=妾)讪(?=其)'
    },
    {
        name: '中庭',
        mean: '庭院里。',
        regex: '(?<=于)中庭(?=，)'
    },
    {
        name: '施施',
        mean: '喜悦的样子。',
        regex: '(?<=也)，施施(?=从)'
    },
    {
        name: '希',
        mean: '通稀。',
        regex: '(?<=几)希(?=矣)'
    },
]

const content20 = 
    "<h1>弈秋</h1>" +
    "<h3>【作者】孟子及弟子 【朝代】先秦</h3>" +
    "<p>孟子曰：“无或乎王之不智也。虽有天下易生之物也，一日暴之，十日寒之，未有能生者也。</p>" +
    "<p>吾见亦罕矣，吾退而寒之者至矣，吾如有萌焉何哉？今夫弈之为数，小数也；不专心致志。则不得也。弈秋，通国之善弈者也。使弈秋诲二人弈，其一人专心致志，惟弈秋之为听。一人虽听之，一心以为有鸿鹄将至，思援弓缴而射之，虽与之俱学，弗若之矣，为是其智弗若与？曰：非然也。” </p>"

    const words20 = [
    {
        name: '孟子',
        mean: '孟子，名轲，字子舆东周战国时期伟大的思想家、教育家、政治家、文学家。',
        regex: '孟子(?=曰)'
    },
    {
        name: '无或',
        mean: '不值得奇怪。或，同惑，奇怪。',
        regex: '(?<=“)无或(?=乎)'
    },
    {
        name: '易生',
        mean: '容易生长。',
        regex: '(?<=下)易生(?=之)'
    },
    {
        name: '暴',
        mean: '同曝，晒。',
        regex: '(?<=日)暴(?=之)'
    },
    {
        name: '罕',
        mean: '少。',
        regex: '(?<=亦)罕(?=矣)'
    },
    {
        name: '弈',
        mean: '围棋。',
        regex: '(?<=夫)弈(?=之)'
    },
    {
        name: '数',
        mean: '技术，技巧。秋，人名，因他善于下棋，所以称为弈秋。',
        regex: '(?<=为)数(?=，)'
    },
    {
        name: '通',
        mean: '整个，全部。',
        regex: '(?<=，)通(?=国)'
    },
    {
        name: '善',
        mean: '善于，擅长做的人。',
        regex: '(?<=国)之善(?=弈)'
    },
    {
        name: '使',
        mean: '假使。',
        regex: '(?<=。)使(?=弈)'
    },
    {
        name: '诲',
        mean: '教导。',
        regex: '(?<=秋)诲(?=二)'
    },
    {
        name: '以为',
        mean: '认为，觉得。',
        regex: '(?<=心)以为(?=有)'
    },
    {
        name: '鸿鹄将至',
        mean: '鸿鹄，天鹅。将至，将要到来。',
        regex: '(?<=有)鸿鹄将至(?=，)'
    },
    {
        name: '思援',
        mean: '思，想。援，拿起。',
        regex: '(?<=，)思援(?=弓)'
    },
    {
        name: '缴',
        mean: '系在箭上的绳，代箭。',
        regex: '(?<=弓)缴(?=而)'
    },
]

const dict = {
    '1-1': {
        'content': content1,
        'words': words1,
    },
    '1-2': {
        'content': content2,
        'words': words2,
    },
    '1-3': {
        'content': content3,
        'words': words3,
    },
    '1-4': {
        'content': content4,
        'words': words4,
    },
    '2-1': {
        'content': content5,
        'words': words5,
    },
    '2-2': {
        'content': content6,
        'words': words6,
    },
    '2-3': {
        'content': content7,
        'words': words7,
    },
    '2-4': {
        'content': content8,
        'words': words8,
    },
    '3-1': {
        'content': content9,
        'words': words9,
    },
    '3-2': {
        'content': content10,
        'words': words10,
    },
    '3-3': {
        'content': content11,
        'words': words11,
    },
    '3-4': {
        'content': content12,
        'words': words12,
    },
    '4-1': {
        'content': content13,
        'words': words13,
    },
    '4-2': {
        'content': content14,
        'words': words14,
    },
    '4-3': {
        'content': content15,
        'words': words15,
    },
    '4-4': {
        'content': content16,
        'words': words16,
    },
    '5-1': {
        'content': content17,
        'words': words17,
    },
    '5-2': {
        'content': content18,
        'words': words18,
    },
    '5-3': {
        'content': content19,
        'words': words19,
    },
    '5-4': {
        'content': content20,
        'words': words20,
    },
}

export function getWords(order: string) {
    return dict[order as keyof typeof dict]['words']
}

export function words(order: string) {
    let words = dict[order as keyof typeof dict]['words']
    let content = dict[order as keyof typeof dict]['content'];
    for (let i = 0; i < words?.length; i++) {
        let regex = new RegExp(words[i].regex);
        // console.log(regex)
        content = content.replace(
            regex,
            `<span id=${i} class="high-light">${words[i].name}<\/span>`
        );
    }
    // console.log(content1)
    // console.log(React.createElement('div','',content1))
    return content;
}
